[
  {
    "text": "National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus _____________________________________________ _____________________ Student Name Roll No. Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space write on the back side of the paper and clearly mark question and part number etc. Write your name at the end of question three for bonus marks. 4. After asked to commence the exam, please verify that you have Five (5) different printed pages including this title page. There are a total of 3 questions. 5. Calculator sharing is strictly prohibited. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. Q-1 Q-2 Q-3 Total Marks Obtained Total Marks 12 8 10 30 Serial No: Sessional Exam-I Total Time: 1 Hour Total Marks: ________________ Signature of Invigilator CS-1002: Programming Fundamentals Monday, 26th September, 2022 Course Instructors Mr. Adil Majeed, Ms. Ayesha, Dr. Hasan Mujtaba National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 2 of 5 Question 1 [12 Marks] What is the output for the following code codes in the corresponding output column. If there are any errors, then mention them clearly. Assume that the header files are included in each code’s snippet. C++ Code Output 1 int main(){ int x = 5, y = 30; if(y/x > 2){ if(y % x !=2) x = x + 2; cout<<x<<”\\n“<<y;} cout<<x<<y; return 0;} 2 int main(){ int a =8; float b=4.5; a=b+3; cout<< a+b; return 0;} 3 int main(){ int a=6+1, b=0, c=2; a = 3 + (b =5) ; c=c+a*5+( c+17) ; cout<<a<<b<<c; return 0;} 4 int main(){ int n = 10; if(n>0) cout<< “n is positive\\n”; if(n>10) cout<<”n is greater than 10”; cout<< “ The value of n:”<<n; if(n<100) cout<<”\\n n is less than 100”; return 0;} 5 int main(){ int x=2, y=11, z=20; if(x>16 && y>x || z%2==0 ) cout<<“Hello World“; else cout<< “BYE”; National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 3 of 5 6 int main(){ int a=7,b=6,c=0; switch(0){ case 1: a=6; b=8; cout<<a<<endl; case 0: b=a+c; cout<<b<<endl; default: c=b+3; cout<<c<<endl;} cout<<a<<\" \"<<b<<\" \"<<c;} Question 2 [8 Marks] Write down the reasons and types of error in the following code. Assume that the header files are included in each code’s snippet. C++ Code Error 1 int main(){ int a, b, mult; cout<< “Enter 1st number”; cin>>a; cout<< “Enter 2nd number; cin>>b; sum = a+b; cout<sum; return 0;} 2. int main(){ int Ascii_value =20; if( Ascii_value >=0 && Ascii_value>=47 || Ascii_value >=54 && Ascii_value <=64) || Ascii_value>=91) cout<< “ You have entered special character”; return 0;} 3. int main(){ int n = 9, div = 0; div = n/0; cout << \"result =",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 3049,
    "source_document": "AIDS 22F PF Mid1.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "= a+b; cout<sum; return 0;} 2. int main(){ int Ascii_value =20; if( Ascii_value >=0 && Ascii_value>=47 || Ascii_value >=54 && Ascii_value <=64) || Ascii_value>=91) cout<< “ You have entered special character”; return 0;} 3. int main(){ int n = 9, div = 0; div = n/0; cout << \"result = \"<< div;} 4. int main(){ int a, b, c; a + b = c;} National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 4 of 5 Question 3 [10 Marks] In a couple of months there is the event of 23 March because of Pakistan day. You are wanting to go to see Parade in Islamabad but this place/Park is at an extensive distance so you will check tickets availability on the web. You are required to create a Ticket Booking System of Parade where you will enter the hours people will remain there, and the swings children were going to choose. Furthermore: The ticket rates for Park • Children under 10 are not permitted to sit on Park • 10-15(age) wins 10 % OFF • 15-20 5% OFF *Above 20 are not allowed Note: cost of ticket is PKR 10 per hour The rates for Park swings • 1-5 (age) wins 50 % OFF • 5-10 25% OFF *Above 10 are not allowed Note: cost of ticket is PKR 10 Program will at that point request to enter age of person and hours will remain in the park. The next part of program will find the total bill based on above requirement and display the total bill. National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 5 of 5",
    "chunk_type": "generic",
    "word_count": 282,
    "char_count": 1504,
    "source_document": "AIDS 22F PF Mid1.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner Scanned with CamScanner",
    "chunk_type": "generic",
    "word_count": 51,
    "char_count": 407,
    "source_document": "PF Final Exam (Fall-2023).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus _____________________________________________ _____________________ Student Name Roll No. Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use last 3 pages for rough work. Work written on rough pages will not be marked. 3. After asked to commence the exam, please verify that you have 15 different printed pages including this title page and rough work. There are a total of 5 questions. 4. Calculator sharing is strictly prohibited. 5. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 6. Add smiley face in front of instruction number 2 to get 5 bonus marks. Q-1 Q-2 Q-3 Q-4 Q-5 Total Marks Obtained Total Marks 65 10 10 10 10 105 Serial No: Final Exam Total Time: 3 Hour Total Marks: 105 ________________ Signature of Invigilator CS-1002: Programming Fundamentals Friday, 16th Dec, 2022 Course Instructors Dr. Aleem, Dr. Akhter, Ms. Ifrah, Mr. Shehreyar National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Question 1 [ 13*5=65 Marks] Write the output of the following C++ programs. Please note that there is no syntax and logical error in the programs. int Quad(int n) { return (n*n*n*n); } int main() { int num=1634; int res=0; int remainder; int n = num; while(n!=0) { remainder = n % 10; res = res + Quad(remainder); n = n / 10; } cout<<\"\\n Result:\"<<res; return 0; } Output: 1634 int main() { int y = 2; switch (y) { case 0: y = y + 11; case 1: y = y / 2; case 2: y = y * 5; case 3: y = y + 1; default: y = y % 3; } cout << y << endl; return 0; } Output: 2 Page 2 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus int main() { int i, j, m, answer; m = 0; j = 3; while (m < 3) { for (i = 0; i < j; i++) { answer = i *m; cout << answer; } m = m + 1; cout << endl; } return 0; } Output: 000 012 024 int main() { int num[5]= {1,2,3,4,5}; int* p; p = num; *p = 20; p = &num[1]; *(++p) = 30; p = num + 4; *p = 30; p = num; *(p + 3) = 40; for (int i = 1; i < 5; i++) cout << num[i] << \" \"; return 0; } Output: 2 30 40 30 Page 3 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus int main() { int x[10]={0,1,2,3,4,5,6,7,8,9}; int *ptr1,*ptr2; ptr1=x+2; ptr2=&x[9]; cout<<*ptr1 * *ptr2; return 0; } Output: 18 int WHAT(int A[], int N){ int ANS =",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2724,
    "source_document": "PF Final Exam (Solution) (Fall-2022).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "0; } Output: 2 30 40 30 Page 3 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus int main() { int x[10]={0,1,2,3,4,5,6,7,8,9}; int *ptr1,*ptr2; ptr1=x+2; ptr2=&x[9]; cout<<*ptr1 * *ptr2; return 0; } Output: 18 int WHAT(int A[], int N){ int ANS = 0; int S = 0; int E = N-1; for(S = 0, E = N-1; S < E; S++, E--) ANS += A[S] - A[E]; return ANS; } int main(){ int A[] = {1, 2, 3, 4, -5, 1, 3, 2, 1}; cout<< WHAT(A, 7); return 0; } Output: 7 int main() { int *a, *b, *c; int x = 800, y = 300; a = &x; b = &y; *a= (*b) - 200; cout<<x<<\" \"<<*a; return 0; } Output: 100 100 Page 4 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus int get(int N=0) { int static x = 0; return x++; } int main() { const int N = 6; int nums[] = { 1,2,3,4,5,6 }; int idx=1; while (idx) { idx = get(get()); if (idx >= N) { break; } cout << nums[idx] << endl; } return 0; } Output: 2 4 6 int main() { int i, j, var = 'A'; for (i = 3; i >= 1; i--) { for (j = 0; j < i; j++) { if(((i+var + j))%4==0) continue; cout<<char (i+var + j); } cout<<endl; } return 0; } Output: EF C B Page 5 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus void Sum(int a) { cout << a + 100 << endl; } void Sum(int a, int b, int c = 10) { cout << a + b + c << endl; } int main() { Sum('A'); Sum('B', 30); Sum(20, 30, 90.5); return 0; } Output: 165 106 140 void find(int , int& , int& ,int=4); int main() { int one=1, two=2, three=3; find(one, two, three); cout <<one<<\",\"<<two<<\",\"<<three<<endl; return 0; } void find(int a, int& b, int& c, int d) { if(d<1) return; cout<<a<<\",\"<<b<<\",\"<<c<<endl; c = a + 2 * b; int temp = b; b = a; a = 2 * temp; d%2?find(b,a,c,d-1):find(c,b,a,d-1); } Output: 1,2,3 5,1,4 5,2,7 9,5,4 1,5,5 Page 6 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus char c[7][11] = {\"PF-Final\",\"PF\",\"Exam\",\"Students\",\"lazy\",\"2022\", \"programmer\"}; char* add(char* ptr){ return ptr + 11; } char* sub(char* ptr){ return ptr - 11; } int main() { char * mystery=c[4]; cout<<mystery<<endl; cout<<sub(mystery)[2]<<endl; mystery= sub(mystery); cout<<mystery<<endl; cout<<sub(mystery) + 1 <<endl; cout<<add(add(mystery))+13<<endl; cout<<*add(add(mystery))<<endl; return 0; } Output: lazy u Students xam ogrammer 2 Page 7 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus const int s=3; int* listMystery(int list[][::s]){ int i = 1,k=0; int *n = new int[::s]; for(int i=0;i<::s;++i) n[i]=0; while(i < ::s) { int j = ::s - 1; while(j >= i) { n[k++]=list[j][i] * list[i][j]; j = j - 1; } i = i + 1; } return n; } void",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2784,
    "source_document": "PF Final Exam (Solution) (Fall-2022).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "int s=3; int* listMystery(int list[][::s]){ int i = 1,k=0; int *n = new int[::s]; for(int i=0;i<::s;++i) n[i]=0; while(i < ::s) { int j = ::s - 1; while(j >= i) { n[k++]=list[j][i] * list[i][j]; j = j - 1; } i = i + 1; } return n; } void displayMystery(int * arr){ cout<<\"[ \"; for(int i=0;i<::s;++i) cout<<arr[i]<<(i!=(::s - 1)?\" , \":\" \"); cout<<\"]\"<<endl; } int main(){ int L[][::s] = {{8, 9, 4}, {2, 3, 4}, {7, 6, 1}}; int *ptr=listMystery(L); displayMystery(ptr); delete [] ptr; return 0; } Output: [ 24 , 9 , 1 ] Page 8 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Question 2 [10 Marks] Complete the C++ code for a function Mirror-TwoD which takes a two-dimensional integer array with its rows and column size as input parameters. This function verifies and returns true, if the data elements in array creates a mirror effect, and false otherwise. Please note that you have to complete the code by writing on the blank lines. Each line should contain only one statement. A Mirror array: 1. Has the same number of rows and columns, (Square array) 2. Has the same values on the main diagonal. 3. The data elements and their ordering are same above and below main diagonal. For Example, the arrays given below are Mirror-TwoD But the following arrays are NOT Mirror-TwoD. (Please look at bold digits) bool Mirror_TwoD(int arr[][4], int rows, int cols) { if (rows != cols) return ____ false __________; for (int i = 0; i < rows; ++i) { if (______arr[0][0] != arr[i][i]_) return false; for (int j = i + 1; j < cols; ++j) { if (arr[i][j] != arr[j][i]) return false; } Page 9 of 15 1 2 3 2 1 6 3 6 1 1 2 3 4 2 1 6 7 3 6 1 9 4 7 9 1 5 2 2 2 2 5 2 2 2 2 5 2 2 2 2 5 1 2 3 4 2 1 6 7 3 6 1 9 4 5 9 1 5 2 2 8 2 5 2 2 8 2 5 2 2 5 2 5 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus } return true; } Question 3 [10 Marks] PN is the nth Pell number that is generated as follows: PN =2 * PN-1 + PN-2 Write a recursive function PellNum to generate Nth Pell number for the given value of N. NOTE: 0th Pell number is equal to 0, and 1st P number is equal to 1. Use of any loop, static, or global data-item will result in Zero marks. Please note that you have to complete the code by writing on the blank lines. Each line should contain only one statement. int pellNum(int n) { if(n <= 2) return n; return 2*pellNum(n-1) + pellNum(n-2); } int main() { int n; cin>>n; cout << pellNum(n)<<endl; // Pell number at that position. return 0; } Page 10 of 15 National University of",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2587,
    "source_document": "PF Final Exam (Solution) (Fall-2022).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "on the blank lines. Each line should contain only one statement. int pellNum(int n) { if(n <= 2) return n; return 2*pellNum(n-1) + pellNum(n-2); } int main() { int n; cin>>n; cout << pellNum(n)<<endl; // Pell number at that position. return 0; } Page 10 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Question 4 [10 Marks] Complete the following C++ function. The functions finds the middle element of the char array using a single loop. For example, if the given char array is “abcde” then function must return character ‘c’. If there are even number of characters in the character array, then there would be two middle characters, function should return second middle element. For example, middle character of “abcdef” is ‘d’. Note: more than one single loop, nested loop and built-in functions are not allowed. Please note that you have to complete the code by writing on the blank lines. Each line should contain only one statement. char* findMidPosition(char * sp) { char* fp=sp; while (*fp!= '\\0' && *(fp+1)!= '\\0' ) { sp=sp+1; fp=fp+2; } return sp; } Page 11 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Question 5 [10 Marks] Complete the following function that evaluates a given polynomial. It takes four arguments. The first argument is a pointer to an integer array, which is an array of coefficients ordered from lowest to highest: . The second parameter is an integer size of the array, the third is an integer value x, and the 𝑎0, 𝑎1, 𝑎2, …𝑎𝑛−1, 𝑎 𝑛 fourth parameter is an integer which is used to return the value of the evaluated polynomial. Your function should evaluate the polynomial at x: 𝑓𝑥 ( ) = 𝑎0𝑥 0 + 𝑎1𝑥 1 + 𝑎2𝑥 2….. + 𝑎𝑛−1𝑥 𝑛−1 + 𝑎𝑛𝑥 𝑛 For example, if the array of coefficients is int arr[] = {2, 3, 1, 2}, size =4, x=4, then the function should return 158 which is obtained by evaluating the polynomial f(x) as shown above. Your CalcPoly function must follow these rules: - You cannot declare any variable inside this function - You cannot change the return type of the function. You should be able to pass the value of the evaluated polynomial back to the main function. - Only while loop is allowed inside the function for evaluation of the polynomial void CalcPoly(int *ptr, int size, int x, int &value) { while (size-- > 0) { value += *(ptr + size) * pow(x, size); } } int main() { int arr[] = { 2, 3, 1, 2 }; int output=0, x = 4, size=4; //Call CalcPoly function properly below CalcPoly(arr,size, x, output); cout << output } Page 12 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Rough Work: Page 13 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Rough Work: Page 14 of 15 National University of Computer and Emerging Sciences FAST School",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2942,
    "source_document": "PF Final Exam (Solution) (Fall-2022).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Rough Work: Page 13 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Rough Work: Page 14 of 15 National University of Computer and Emerging Sciences FAST School of Computing Spring-2022 Islamabad Campus Rough Work: Page 15 of 15",
    "chunk_type": "generic",
    "word_count": 61,
    "char_count": 404,
    "source_document": "PF Final Exam (Solution) (Fall-2022).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 1 of 12 Instructions: 1. Attempt first two questions on the question paper and return the question paper along with the answer sheet. 2. All solution codes should be indented as well as appropriately commented. 3. Use permanent ink pens only. Any part done using a soft pencil will not be marked and cannot be claimed for rechecking. 4. Ensure that you do not have any electronic gadgets (like mobile phones, smart watches, etc.) with you. 5. Read the question carefully, understand the question, and then attempt your answers in the provided answer booklet. 6. Verify that you have eight (08 printed pages of the question paper including this page. There are six (06) questions. Question 1 [9*2 = 18 Marks] Write a one-line C++ statement for each of the following tasks. The statement must be written clearly and without any cutting/overwriting. If there are two or more ways to perform the given task then choose the best option. The answer must be a single-line statement. 1. Write a cout statement to display the global variable “Mystery” in the given function: int Mystery = 10; void my_function() { int Mystery = 6; //write cout statement to access the Global variable here } std::cout << ::Mystery << std::endl; 2. Write a prototype of the function named “my_func”. The function returns nothing but it takes three parameters x, y and z; where x has a default value of 2, y has no default value and z has a default value of 5. void my_func(int x = 2, int y, int z = 5); 3. Declare a pointer ptr that can point to any of the two variables holding values 12 and ‘a’ respectively. CS-1002: Programming Fundamentals Date: 20th May, 2024 Course Instructor(s) Asif Malik Final Exam Total Time: 3 Hours Total Marks: 100 ______________________ ______________ _______________ __________________ Student Name Roll No. Course Section Student Signature National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 2 of 12 void* ptr; 4. Write a statement to reserve enough space for a double-type variable in the stack memory. double stack_var; 5. Write a statement to reserve enough space for a double-type variable in the heap memory. double* heap_var = new double; 6. Assume that an add() function exists (prototype given below). You are asked to make another function which adds two characters by concatenating them and returns a string. For example, adding ‘a’ and ‘b’ should return “ab”. Just write a prototype of this required function. int add(int a, int b); std::string add(char a, char b); 7. char *p1 = new char; char *p2 = new char; Write a statement to make p1 dangling pointer. delete p1; 8. Write a statement to undangle pointer p1 after it had become dangling in the previous question. p1 = nullptr; 9. What would be the function prototype (write it) if we could have the following function call? DO NOT use variable names in the prototype. char ch = ‘Z’;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 3029,
    "source_document": "PF Final Exam (Solution) (Spring-2024).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "p1; 8. Write a statement to undangle pointer p1 after it had become dangling in the previous question. p1 = nullptr; 9. What would be the function prototype (write it) if we could have the following function call? DO NOT use variable names in the prototype. char ch = ‘Z’; int x=foo(7.5+1, &ch, ch, foo(1.5,&ch,20); int foo(double, char*, char, int); Question 2 [9*2 + 1*6 + 1*5 + 1*10 = 39 Marks] Write the output of the following C++ codes (if the code is correct). If you find any error/s in the code, please identify, and explain the error/s (Note: do not write output if there is an error). Assume that required libraries and main functions are already included in the program. 10. int i = 6, counter = 0; while(i-2) { i++; counter++; National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 3 of 12 cout << \"Loop is running for \" << counter << \" time\" <<endl; } Output/Error: Infinite Loop. 11. #include<iostream.h> int MyFunction(int a,int b=3,int c=3) { cout<< ++a * ++b * --c ; return 0; } int main() { MyFunction(5, 0, 0); return 0; } Output/Error: -6 12. #include<iostream> using namespace std; int main() { int a = 32, *ptr = &a; char ch = 'A', *cho = &ch; //ASCII of 'A' is 65 *cho += 3; *ptr += ch; cout << a << \", \" << ch << endl; return 0; } Output/Error: 100, D 13. int my_func(int num) { cout << num << endl; return num*-2; } int main() { cout<<my_func(my_func(4)*2); return 0;} Output/Error: 4 -16 32 National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 4 of 12 14. void f2(int *p){ int* x = new int; *x = 10; p = x; cout<<*p<<endl;} void f1(int *p){ f2(p); } int main() { int x=5; int *p=&x; f1(p); cout<<*p<<endl<<x<<endl; return 0; } Output/Error: 10 5 5 15. int a=20; //suppose a is stored at address 0x4B int *p=&a; *p = 30; cout<<a<<endl<<p; Output/Error: 30 0x4B 16. int x=100,y=200; int *const p; p = &x; cout<<*p<<endl; p = &y; cout<<*p<<endl; Output/Error: Compilation error. 17. int a = 0, b=36; float f=3.9; b+=(a = 50)*(int)f%3+5.1-6.8*10-b/5; cout << a << \"$\" << b; Output/Error: 50$-33 National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 5 of 12 18. char* str1 = \"Self-conquest is the greatest victory স হ ঺ ঻\"; char str2[80]; char* src = str1; char* dest = str2; while( *src ) *dest++ = *src++; *dest = '\\0'; cout << str2 << endl; Output/Error: Self-conquest is the greatest victory 😊 19. #include<iostream> using namespace std; int fib(int n=1, int m=2) { static int memo[100] = {0}; if (n <= 1) { return n; } if (memo[n] == 0) { for (int i = 0; i < 2; ++i) memo[n]= (n-1) + (n-2); cout<<memo[n]<<endl; } else cout<<memo[n]<<endl; return memo[n]; } int main() { static int n=3; std::cout << fib(5) << std::endl; std::cout << fib(10) << std::endl; std::cout << fib(5) <<",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2882,
    "source_document": "PF Final Exam (Solution) (Spring-2024).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "1) { return n; } if (memo[n] == 0) { for (int i = 0; i < 2; ++i) memo[n]= (n-1) + (n-2); cout<<memo[n]<<endl; } else cout<<memo[n]<<endl; return memo[n]; } int main() { static int n=3; std::cout << fib(5) << std::endl; std::cout << fib(10) << std::endl; std::cout << fib(5) << std::endl; return 0; } [06 Marks] Output/Error: 7 7 17 17 7 7 National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 6 of 12 20. void magic (int* ptr, int size) { ptr = new int[size+1]; for(int i=size,j=0;i>=0;i--,j++) ptr[j]=i; } int main() { int* ptr = nullptr; int size = 5; magic(ptr,size); for(int i=0; i<size ;i++) cout<<*(ptr + i)<<\" \"; delete [] ptr; ptr = nullptr; return 0; } [05 Marks] Output/Error: Segmentation fault 21. const char* c[] = { \"PF\", \"Exam\" , \"centipede\", \"Project\" }; char const * * cp[] = { c + 2, c + 3, c , c + 1 }; char const *** cpp[] = { cp + 1 ,cp + 2 }; int main() { cout << ***cpp[1] << endl; cout << (*cpp)[-1][0] << endl; cout << (*cp)[-1] << endl; cout << (*(cpp[1][-1]) + 3) << endl; return 0; } [10 Marks] Output/Error: P centipede Exam ject Question 3 [10 Marks] Write a program to get a number from user and check if that integer is a power of 2. Use bitwise operators to check (see some facts given below for the hint). Input validation is must: number should not be zero, use of any power function is not allowed. 1. If number is power of 2 then then find all roots of a quadratic equation using the nested switch statement. Take a, b, c as input from the user and display the both roots. Format your root values in fixed-point notation, with two decimal places of precision. 2. If it is not power of 2, then display a message that the number is not power of 2. National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 7 of 12 Note: You may use the sqrt() function of <math.h> library to find the square root. Power of 2: Some facts about numbers which are power of 2. You may use these facts to check if it is power of 2 or not. Suppose N is power of 2, then:  all bits of N are zero except (any) one bit.  All least significant bits of N-1 before the ON bit of N are always ON. Quadratic equation: In elementary algebra quadratic equation is an equation in the form of Solving quadratic equation A quadratic equation can have either one or two distinct real or complex roots depending upon the nature of the discriminant of the equation. Where discriminant of the quadratic equation is given by Depending upon the nature of the discriminant, formula for finding roots can be given as: ➢ Case 1: If the discriminant is positive. Then there are two real distinct roots given by. ➢ Case 2: If discriminant",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2742,
    "source_document": "PF Final Exam (Solution) (Spring-2024).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "discriminant of the equation. Where discriminant of the quadratic equation is given by Depending upon the nature of the discriminant, formula for finding roots can be given as: ➢ Case 1: If the discriminant is positive. Then there are two real distinct roots given by. ➢ Case 2: If discriminant is zero. Then it has exactly one real root given by. ➢ Case 3: If discriminant is negative. Then it will have two distinct complex roots given by. root 1 = root 2 = ି௕ ଶ௔, Imaginary = √ି௱ ଶ௔ Solution: #include <iostream> #include <cmath> bool isPowerOfTwo(int n) { return n && !(n & (n - 1)); } int main() { int num; std::cout << \"Enter a number: \"; std::cin >> num; if (num == 0) { std::cout << \"Error: Number should not be zero.\" << std::endl; return 1; } National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 8 of 12 if (isPowerOfTwo(num)) { double a, b, c; std::cout << \"Enter coefficients (a, b, c) for quadratic equation (ax^2 + bx + c = 0): \"; std::cin >> a >> b >> c; double discriminant = b * b - 4 * a * c; switch (discriminant > 0 ? 1 : (discriminant == 0 ? 2 : 3)) { case 1: { double root1 = (-b + sqrt(discriminant)) / (2 * a); double root2 = (-b - sqrt(discriminant)) / (2 * a); std::cout << \"Root 1: \" << std::fixed << root1 << std::endl; std::cout << \"Root 2: \" << std::fixed << root2 << std::endl; break; } case 2: { double root = -b / (2 * a); std::cout << \"Root: \" << std::fixed << root << std::endl; break; } case 3: { double realPart = -b / (2 * a); double imaginaryPart = sqrt(-discriminant) / (2 * a); std::cout << \"Root 1: \" << std::fixed << realPart << \" + \" << std::fixed << imaginaryPart << \"i\" << std::endl; std::cout << \"Root 2: \" << std::fixed << realPart << \" - \" << std::fixed << imaginaryPart << \"i\" << std::endl; break; } } } else { std::cout << \"The number is not a power of 2.\" << std::endl; } return 0; } Question 4 [10 Marks] Write a function in C++ which takes a number as input and prints the pattern of alphabets as given below. You are required to validate the input that the number should be in-between 1 and 26. For example, for n=5, print pattern as below A B C D E D C B A B C D E D C B C D E D C D E D E for n=4, print pattern as below A B C D C B A National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 9 of 12 B C D C B C D C D Solution: #include <iostream> void printAlphabetPattern(int n) { if (n < 1 || n > 26) { std::cout << \"Error: Number should be between 1 and 26.\" << std::endl; return;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2556,
    "source_document": "PF Final Exam (Solution) (Spring-2024).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 9 of 12 B C D C B C D C D Solution: #include <iostream> void printAlphabetPattern(int n) { if (n < 1 || n > 26) { std::cout << \"Error: Number should be between 1 and 26.\" << std::endl; return; } for (int i = 0; i < n; i++) { for (int j = 0; j < i; j++) { std::cout << \" \"; // Print spaces to align pattern } char startChar = 'A' + i; for (int j = 0; j < n - i; j++) { std::cout << startChar++ << \" \"; } startChar -= 2; for (int j = 0; j < n - i - 1; j++) { std::cout << startChar-- << \" \"; } std::cout << std::endl; } } int main() { int n; std::cout << \"Enter a number between 1 and 26: \"; National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 10 of 12 std::cin >> n; printAlphabetPattern(n); return 0; } Question 5 [10 Marks] Write a C++ program to input an upper limit and lower limit and check whether the numbers in that range are Strong or not. The upper limit should be always greater than the lower limit, upper and lower should be greater or equal to zero. Write the program neatly with proper variable names, comments and indentation. What is a Strong number? A strong number is a special number whose sum of factorial digits is equal to the original number. For example: 145 is a strong number. Since, 1! + 4! + 5! = 145 Solution: #include <iostream> // Function to calculate the factorial of a number int factorial(int n) { if (n == 0 || n == 1) { return 1; } else { return n * factorial(n - 1); } } // Function to check if a number is strong or not bool isStrong(int num) { int originalNum = num; int sum = 0; while (num > 0) { int digit = num % 10; sum += factorial(digit); num /= 10; } return sum == originalNum; } Program design Marks Proper Input and its validation 2 Using functions (proper call, definition, prototype) 3 Program Logic 4 Correct use of loops 3 Not using comments and indentation -2 National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 11 of 12 int main() { int lowerLimit, upperLimit; // Input lower limit do { std::cout << \"Enter lower limit (greater than or equal to 0): \"; std::cin >> lowerLimit; } while (lowerLimit < 0); // Input upper limit do { std::cout << \"Enter upper limit (greater than lower limit and greater than or equal to 0): \"; std::cin >> upperLimit; } while (upperLimit < lowerLimit || upperLimit < 0); std::cout << \"Strong numbers between \" << lowerLimit << \" and \" << upperLimit << \" are: \"; // Check and print strong numbers within the range for (int i = lowerLimit; i <= upperLimit; ++i) { if (isStrong(i))",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2651,
    "source_document": "PF Final Exam (Solution) (Spring-2024).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": ">> upperLimit; } while (upperLimit < lowerLimit || upperLimit < 0); std::cout << \"Strong numbers between \" << lowerLimit << \" and \" << upperLimit << \" are: \"; // Check and print strong numbers within the range for (int i = lowerLimit; i <= upperLimit; ++i) { if (isStrong(i)) { std::cout << i << \" \"; } } std::cout << std::endl; return 0; } Question 6 [15 Marks] Write a function that accepts an integer 2D array of size 6x6 to find pairs and indexes of elements that have the maximum and minimum difference among all element pairs. Example input: Output : Minimum distance between 1 and 2, at index (0,0) and (0,1) Maximum distance between 1 and 100, at index(0,0) and (4,4) Solution: 1 2 5 7 9 11 13 15 17 19 78 21 23 36 38 78 40 42 44 46 48 50 52 54 56 58 60 62 100 64 66 68 70 72 74 76 National University of Computer and Emerging Sciences FAST School of Computing Spring-2024 Islamabad Campus Page 12 of 12 #include <iostream> #include <cmath> void findMinMaxDifference(int arr[][6]) { int minDiff = INT_MAX, maxDiff = INT_MIN; int minIndexI, minIndexJ, maxIndexI, maxIndexJ; // Iterate through the array to find minimum and maximum differences for (int i = 0; i < 6; ++i) { for (int j = i + 1; j < 6; ++j) { int diff = abs(arr[i][j] - arr[j][i]); if (diff < minDiff) { minDiff = diff; minIndexI = i; minIndexJ = j; } if (diff > maxDiff) { maxDiff = diff; maxIndexI = i; maxIndexJ = j; } } } // Output the results std::cout << \"Minimum distance between \" << arr[minIndexI][minIndexJ] << \" and \" << arr[minIndexJ][minIndexI] << \", at index (\" << minIndexI << \",\" << minIndexJ << \") and (\" << minIndexJ << \",\" << minIndexI << \")\" << std::endl; std::cout << \"Maximum distance between \" << arr[maxIndexI][maxIndexJ] << \" and \" << arr[maxIndexJ][maxIndexI] << \", at index (\" << maxIndexI << \",\" << maxIndexJ << \") and (\" << maxIndexJ << \",\" << maxIndexI << \")\" << std::endl; } int main() { int arr[6][6] = { {1, 2, 5, 7, 9, 11}, {13, 15, 17, 19, 78, 21}, {23, 36, 38, 78, 40, 42}, {44, 46, 48, 50, 52, 54}, {56, 58, 60, 62, 100, 64}, {66, 68, 70, 72, 74, 76} }; findMinMaxDifference(arr); return 0; }",
    "chunk_type": "generic",
    "word_count": 401,
    "char_count": 2100,
    "source_document": "PF Final Exam (Solution) (Spring-2024).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 5
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 1 of 20 _______________________________ ______ ______ _____________________ Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space write on the back side of the paper and clearly mark each question and part number etc. 4. After asked to commence the exam, please verify that you have (18) different printed pages including this title page. There are total of eight (8) questions. 5. Use of calculator is strictly prohibited. 6. Draw a smiley at the bottom of this page and earn ten bonus marks. 7. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 8. Use proper indentation and comments while writing code and make sure that your code is legible. Failing to do so can cost you marks. Q-1 Q-2 Q-3 Q-4 Q-5 Q-6 Q-7 Q-8 Total Marks Obtained Total Marks 60 220 320 100 50 50 100 100 1000 Vetted By: _____________________________Vetter Signature: _____________________ Serial No: Final Exam Total Time: 3 Hour Total Marks: 1000 ________________ Signature of Invigilator CS101 Introduction to Computing Monday, December 16, 2013 Course Instructor Dr. Shahzad Rajput and Dr. Sibt ul Hussain National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 2 of 20 Q. No. 1 [ 6*10=60 marks ] (a) What is the binary representation of 35510? (b) What is the hexadecimal representation of 10338? (c) Given that 12510= 0111 11012, what is the signed binary representation of -12010 (d) Given that 307210 = 6*29 and 4810 = 3*24, what is the binary representation of 313010? (e) What is the 16-bit floating point representation of 10101.01011101101112 in normalized binary form using the following convention? Sign of mantissa = left most bit ( where 0: +; 1: - ) Mantissa = next 11 bits, leading 1 is hidden, really represents 12 bits Exponent = next four bits, bias 7 (f) Interpret the following number given in floating point representation 0101 1110 0000 10012 using the convention mentioned below: Sign of mantissa = left most bit ( where 0: +; 1: - ) Mantissa = next 11 bits, leading 1 is hidden, really represents 12 bits Exponent = next four bits, bias 7 National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 3 of 20 Find its decimal equivalent. Answer: National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 4 of 20 Q. No. 2 [ 11*20=220 marks ] Write the output of the given C++ code segments. (a) Output int sum(int i, int j){ return (i+j+5/2); } int main(){ int i = 7.5, j=4.5; cout << sum(i,j)",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 3017,
    "source_document": "PF Final-Exam Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 4 of 20 Q. No. 2 [ 11*20=220 marks ] Write the output of the given C++ code segments. (a) Output int sum(int i, int j){ return (i+j+5/2); } int main(){ int i = 7.5, j=4.5; cout << sum(i,j) << endl; return 0; } (b) Output for( int i=0; i<7; i++ ) cout << i%3 << \" \"; cout << endl; (c) Output #include <iostream> using namespace std; int main(){ number = 62.7; double number; cout << number << endl; return 0; } (d) Output #include <iostream> using namespace std; int main(){ int tV, fV; int x = 5, y = 10; tV = x < y; fV = y == x; cout << tV << endl << fV << endl; return 0; } National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 5 of 20 (e) Output int num=10; if( num ){ int num = 20; num *= 100; num += 1000; } cout << num << endl; (f) Output #include<iostream> using namespace std; int x = 5; void test(){ cout << ++x; } int main(){ int x = 1000; for( int i = 1; i<5; i++ ) test(); cout << x << endl; return 0; } (g) Output #include<iostream> using namespace std; int magic( int x=10, int y=20 ){ if( x == 10 ) return( y ); return( x + y ); } int main(){ cout << magic() << endl << magic(100) << endl << magic(1000, 2000) << endl; return 0; } (h) Output #include<iostream> using namespace std; int magic( int &x, int y ){ x = 2000; y = 500; return (x-y); } int main(){ int i=500, j=600, k; k = magic( i, j ); cout << i << \" \" << j << \" \" << k << endl; return 0; } (i) Output #include<iostream> using namespace std; National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 6 of 20 void magic( int *p, int s ){ int i = 0; while( s-- > 0 ){ i += *(p++); } cout << i << endl; } int main(){ int arr[] = { 1, 2, 3, 4, 5 }; magic( arr, 5 ); return 0; } (j) Output int arr[] = { 10, 20, 30, 40, 50, 60, 70 }; int *p = &arr[1]; p = p + 4; cout << *p << endl; (k) Output #include<iostream> using namespace std; int main(){ const int M = 10; int N = 2*M; int SH = 10; int A = 0; int p[M]; for( int i=0; i<M; i++ ) p[ i ] = i*10-5; for( int i=1; i<=N; i++ ) *(p+ (i%M) ) += SH; for( int i=0; i<M; i++ ) A += p[ i ]; cout << A << endl; return 0; } National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 7 of 20 Q. No. 3 [ 320 marks ] a) [20 marks] Consider you have two variables: sales",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2402,
    "source_document": "PF Final-Exam Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "i<M; i++ ) A += p[ i ]; cout << A << endl; return 0; } National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 7 of 20 Q. No. 3 [ 320 marks ] a) [20 marks] Consider you have two variables: sales and commissionRate. Write an if statement that performs the following logic: if the variable sales is outside the range [50,000 – 100,000] then assign 0.25 to the commissionRate variable, and assign 250 to the bonus variable. b) [20 marks] Write a for loop that displays all of the odd numbers, 1 through 49. c) [20 marks] Convert the following for loop to a while loop: for (int x = 50; x > 0; x--){ cout << x << \" seconds to go.\\n\"; } d) [20 marks] Write a function named tenTimes. The function should have an integer parameter named number. When tenTimes is called, it should return the tenth power of the number (i.e., number10). National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 8 of 20 e) [40 marks] Write a nested for loop that displays the following output on screen: 6 1 6 7 2 14 8 3 24 6 1 6 7 2 14 6 1 6 f) [20 marks] Complete the following program skeleton by writing a switch statement that displays “one” if the user has entered 1, “two” if the user has entered 2, and “three” if the user has entered 3. If a number other than 1, 2 or 3 is entered, the program should display an error message. #include<iostream> using namespace std; int main(){ int userNum; cout << “Enter one of the numbers 1, 2, or 3: ”; cin >> userNum; // // Write the switch statement here. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 9 of 20 // return 0; } g) [20 marks] Convert the following if/else if statement into a switch statement: if (choice == 1){ cout << fixed << showpoint << setprecision(2); } else if (choice == 2 || choice == 3){ cout << fixed << showpoint << setprecision(4); } else if (choice == 4){ cout << fixed << showpoint << setprecision(6); } else { cout << fixed << showpoint << setprecision(8); } National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 10 of 20 h) [40 marks] Write a piece of C++ program that prompts the user for entering a number, say x, and prints: 1, 2, 3, …, x-1, x, x-1, …, 3, 2, 1 Assume that x > 1. For example, if the input is 5, the output should be 1 2 3 4 5 4 3 2 1, similarly if the input is 2, the output should be 1 2 1. i) [20 marks] Let Nums be an integer array with 20 elements. Write a for loop that prints each element of the array. j) [10 marks] Define a two-dimensional array of integers named grades. It should",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2674,
    "source_document": "PF Final-Exam Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "1, similarly if the input is 2, the output should be 1 2 1. i) [20 marks] Let Nums be an integer array with 20 elements. Write a for loop that prints each element of the array. j) [10 marks] Define a two-dimensional array of integers named grades. It should have 30 rows and 10 columns. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 11 of 20 k) [20 marks] An application uses a two-dimensional array defined as: int days[29][5]; Write code that sums each row in the array and displays the results. l) [10 marks] Look at the following array definition: int set[10]; Write a statement using pointer notation that stores the value 99 in set[7]. m) [20 marks] Write code that dynamically allocates an array of x integers (where x is taken as input from the user), and then uses a loop to allow the user to enter values for each element of the array. Perform both the operation using a pointer. n) [10 marks] Assume that tempNumbers is a pointer that points to a dynamically allocated array. Write code that releases the memory used by the array. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 12 of 20 o) [10 marks] Look at the following function definition. void getNumber(int &n){ cout << \"Enter a number: \"; cin >> n; } In this function, the parameter n is a reference variable. Rewrite the function so that n is a pointer. p) [20 marks] Declare a structure named Circle, with the following members: x: an integer y: an integer r: a float Next, write statements that A) define a Circle structure variable named circle B) assign 12 to the x member of circle C) assign 7 to the y member of circle D) assign 3.5 to the r member of the circle D) display the contents of the x, y and r members of circle National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 13 of 20 National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 14 of 20 Q. No. 4 [ 100 marks ] Source Character A B C D E F G H I J K L M Encrypted Character L M D P A R T F V G Y K Z Source Character N O P Q R S T U V W X Y Z Encrypted Character O N C E Q B S H U I W J X (a) Write a function named encrypt that receives a string/c-string containing only the alphabets [A-Z] and its size as arguments and return the encrypted string. The encryption should be performed using the lookup (mapping) table given above. For e.g., encrypt(“PAKISTAN”, 8) should return “CLYVBSLO”. (b) Write a function named decrypt that receives a string/c-string containing only the alphabets [A-Z] and its size as arguments and return the decrypted string. The decryption should be performed using the lookup (mapping) table",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2779,
    "source_document": "PF Final-Exam Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "performed using the lookup (mapping) table given above. For e.g., encrypt(“PAKISTAN”, 8) should return “CLYVBSLO”. (b) Write a function named decrypt that receives a string/c-string containing only the alphabets [A-Z] and its size as arguments and return the decrypted string. The decryption should be performed using the lookup (mapping) table given above. For e.g., decrypt(“CLYVBSLO”, 8) should return “PAKISTAN”. National Univer School of Computing Q. No. 5 Write a complete C++ program th determinant of the matrix. Recall that (1) the trace of a square (2) the determinant of a rsity of Computer and Emergin g Fall 2013 Islama Page 15 of 20 [ 50 hat reads a 3x3 matrix as input, and computes an matrix is the sum of the diagonal values. a 3x3 matrix is computed as shown below: ng Sciences abad Campus 0 marks ] nd displays the trace and National Univer School of Computing Q. No. 6 Lets assume that we have two ve The dot product between the shown below: The cross between the two vectors is done Write a complete C++ program th vectors as input and the display Note that a solution without usi rsity of Computer and Emergin g Fall 2013 Islama Page 16 of 20 [ 50 ectors: two as shown below: hat defines a structure to store a vector’s informa (1) the dot product, and (2) the cross product betw ing structures would not be graded. ng Sciences abad Campus 0 marks ] o vectors is done as product tion, then read two ween the given vectors. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 17 of 20 Q. No. 7 [ 100 marks ] A minimax or saddle point in a two-dimensional array is an element that is the minimum of its row and the maximum of its column, or vice verse. For example, in the following array 11 22 33 33 99 55 66 77 77 44 99 22 the element 33 is a minimax because it is the maximum of row 0 and the minimum of column 2. The element 55 is another minimax because it is the minimum of row 1 and the maximum of column 1. Write a program that reads a 4-by-3 matrix, and then prints the location and value of each minimax in the matrix. For example, it would print a[0][2] = 33 is a minimax a[1][1] = 55 is a minimax for the matrix shown above. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 18 of 20 Q. No. 8 [ 100 marks ] Write the following function: void rotate(int a[], int n, int k) The function “rotates” the first n elements of the array a, k positions to the right (or -k positions to the left if k is negative). The last k elements are “rotated” around to the beginning of the array. For example, if a is the array shown below: Offset 0 1 2 3 4 5 6 7 Element 22 33 44 55 66 77 88",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2714,
    "source_document": "PF Final-Exam Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "right (or -k positions to the left if k is negative). The last k elements are “rotated” around to the beginning of the array. For example, if a is the array shown below: Offset 0 1 2 3 4 5 6 7 Element 22 33 44 55 66 77 88 99 Then the call rotate(a,8,3) would transform a into Offset 0 1 2 3 4 5 6 7 Element 77 88 99 22 33 44 55 66 Note that the call rotate(a,8,-5) would have the same effect. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 19 of 20 National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 20 of 20",
    "chunk_type": "generic",
    "word_count": 123,
    "char_count": 622,
    "source_document": "PF Final-Exam Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 5
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Spring 2018 Islamabad Campus CS103 Computer Programming Wednesday, May 16, 2018 Course Instructor(s) Sibt ul Hussain, Hassan Mustafa and Raﬁa Rahim Serial No: Final Exam Total Time: 3 Hours Total Marks: 161 Signature of Invigilator Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space use the extra sheets provided inside the booklet but please clearly mark question and part number, etc. 4. After asked to commence the exam, please verify that you have (32) different printed pages including this title page. There are total of (5) questions. 5. Use of calculator is strictly prohibited. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. 8. Please read the question thoroughly and use your time properly, an uneven distribution of time can lead to incomplete answers. 1 Mark = 1 Minute I II III IV V Total Total Marks 81 15 15 15 35 161 Marks Obtained Vetted By: Vetter Signature: CS103 - Computer Programming Spring 2018 Final Exam Question I . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (81 Marks) Please write proper explanation of the bug where required, without proper explanation no marks will be awarded, note there are no syntax errors in the given set of codes. (a) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 int num1 = 392; 2 int& num2 = num1; 3 num2 = 444; 4 num1 = num1 + num2; 5 int *pointer1 = &num1; 6 cout<< *pointer1<<endl; Solution: 1 888 (b) (1 Mark) True/False: You must declare all private members of a class before the public members. Solution: False (c) (1 Mark) Assume that InventoryItem is the name of a class, and the class has a void member function named setPrice which accepts a double argument. If book is an instance of the InventoryItem class, which of the following statements properly uses the book object to call the setPrice member function? ⃝InventoryItem::setPrice(1.49) √book.setPrice(1.49) ⃝book::setPrice(1.49) ⃝book:setPrice(1.49) (d) (1 Mark) Declare an array of three InventoryItem objects. Solution: 1 InventoryItem arr[3]; (e) (10",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2727,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "which accepts a double argument. If book is an instance of the InventoryItem class, which of the following statements properly uses the book object to call the setPrice member function? ⃝InventoryItem::setPrice(1.49) √book.setPrice(1.49) ⃝book::setPrice(1.49) ⃝book:setPrice(1.49) (d) (1 Mark) Declare an array of three InventoryItem objects. Solution: 1 InventoryItem arr[3]; (e) (10 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. Show the complete stack trace as well. 1 #include<iostream> 2 #include<algorithm> 3 #include<iterator> 4 #include<vector> 5 using namespace std; 6 template<class T> 7 ostream & operator<<(ostream & o, vector<T> & t) { 8 for (typename vector<T>::iterator it = t.begin(); it != t.end(); ++it) 9 cout << *it << \" \"; 10 return o; Page 2 of 32 CS103 - Computer Programming Spring 2018 Final Exam 11 } 12 void Magic(vector<vector<int> > &v, int s) { 13 if (s > v.size() / 2) 14 return; 15 for (int i = s; i < v[0].size() - s; ++i) 16 cout << v[s][i] << \" \"; 17 cout << endl; 18 for (int i = s + 1; i < v.size() - s - 1; ++i) 19 cout << v[i][v[0].size() - s - 1] << \" \"; 20 cout << endl; 21 if (s != v.size() / 2) 22 for (int i = v[0].size() - s - 1; i >= s; --i) 23 cout << v[v.size() - s - 1][i] << \" \"; 24 cout << endl; 25 for (int i = v.size() - s - 2; i >= s + 1; --i) 26 cout << v[i][s] << \" \"; 27 cout << endl; 28 Magic(v, s + 1); 29 } 30 int main() { 31 vector<vector<int> > v(3, vector<int>(3, 0)); 32 int count = 0; 33 for (vector<vector<int> >::iterator it = v.begin(); it != v.end(); ++it) 34 for (vector<int>::iterator it2 = it->begin(); 35 it2 != it->end(); ++it2) 36 *it2 = ++count; 37 cout << \"Result\" << endl; 38 Magic(v, 0); 39 } Solution: 1 1 2 3 2 6 Page 3 of 32 CS103 - Computer Programming Spring 2018 Final Exam 3 9 8 7 4 4 5 5 (f) (3 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. 1 string Q = \"ABCDEFG\"; 2 cout << Q + Q.substr(2,4) << \"\\n\"; 3 Q.erase(3,2); 4 cout << Q << \"\\n\"; 5 Q.insert(2,\"123\"); 6 cout << Q; Solution: 1 ABCDEFGCDEF 2 ABCFG 3 AB123CFG Page 4 of 32 CS103 - Computer Programming Spring 2018 Final Exam (g) (3 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. 1 #include <iostream> 2 using namespace std; 3 template<class T> 4 class Parcel{ 5 private: 6 T value; 7 public: 8 Parcel(){ 9 value = 7; 10 cout << value << endl; 11 } 12",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2661,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "if there is any. Please note that there are no syntax errors in the program.. 1 #include <iostream> 2 using namespace std; 3 template<class T> 4 class Parcel{ 5 private: 6 T value; 7 public: 8 Parcel(){ 9 value = 7; 10 cout << value << endl; 11 } 12 Parcel(const T & v){ 13 value = v; 14 cout << value << endl; 15 } 16 ˜Parcel(){cout << value << endl;} 17 }; 18 int main(){ 19 Parcel<int> o1(4); 20 Parcel<float> o2; 21 Parcel<double> o3(2.5); 22 return 0; 23 } Solution: 1 4 2 7 3 2.5 4 2.5 5 7 6 4 (h) (6 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. 1 #include<iostream> 2 using namespace std; 3 template<class T> Page 5 of 32 CS103 - Computer Programming Spring 2018 Final Exam 4 void Qdoba( T x ){ 5 cout << \"Hi\" << endl; 6 } 7 template<class T> 8 void Qdoba( T* x ){ 9 cout << \"Fi\" << endl; 10 } 11 template<> 12 void Qdoba( char* x ){ 13 cout << \"Bi\" << endl; 14 } 15 void Qdoba(int x){ 16 cout << \"Pi\" << endl; 17 } 18 int main(){ 19 int v = 10; 20 int *p = new int(100); 21 char s[10] = \"abc\"; 22 double d = 2.5; 23 Qdoba(v); 24 Qdoba(p); 25 Qdoba(s); 26 Qdoba(d); 27 return 0; 28 } Solution: 1 Pi 2 Fi 3 Bi 4 Hi (i) (6 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. 1 #include <iostream> 2 #include <fstream> 3 using namespace std; 4 class Dummy { 5 int data[5]; 6 int size; 7 int inc; 8 public: 9 void display() { 10 for (int i = 0; i < size; i++) Page 6 of 32 CS103 - Computer Programming Spring 2018 Final Exam 11 cout << data[i] + inc << endl; 12 } 13 }; 14 int main() { 15 Dummy D; 16 int temp[] = { 0, 1, 2, 3, 4, 5, 6 }; 17 ofstream ofile(\"dummy.dat\", ios::binary); 18 ofile.write((char*) temp, sizeof(temp)); 19 ofile.close(); 20 ifstream ifile(\"dummy.dat\", ios::binary ); 21 ifile.read((char*) &D, sizeof(D)); 22 D.display(); 23 ifile.close(); 24 return 0; 25 } Solution: 1 6 2 7 3 8 4 9 5 10 (j) (10 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. 1 #include <iostream> 2 #include <vector> 3 using namespace std; 4 template<class T, class U> 5 class Data { 6 public: 7 T key; 8 U value; 9 Data(T x = 0, U y = 0) : 10 key(x), value(y) { 11 } 12 }; 13 template<class T, class U> 14 void operator<<(ostream &out, Data<T, U> dat) { Page 7 of 32 CS103 -",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2534,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "U> 5 class Data { 6 public: 7 T key; 8 U value; 9 Data(T x = 0, U y = 0) : 10 key(x), value(y) { 11 } 12 }; 13 template<class T, class U> 14 void operator<<(ostream &out, Data<T, U> dat) { Page 7 of 32 CS103 - Computer Programming Spring 2018 Final Exam 15 out << dat.key << endl; 16 dat.value->start(); 17 } 18 class Vehicle { 19 public: 20 virtual void start() { 21 cout << \"The vehicle is started\" << endl; 22 } 23 virtual void start(Vehicle &v) { 24 start(); 25 v.start(); 26 } 27 }; 28 class Car: public Vehicle { 29 public: 30 void start() { 31 cout << \"The car is started\" << endl; 32 } 33 }; 34 class SuperCar: public Car { 35 public: 36 void start() { 37 cout << \"The SuperCar is started\" << endl; 38 } 39 }; 40 int main() { 41 vector<Data<string, Car*> > directory; 42 directory.push_back(Data<string, Car*>(\"Mehran\", new Car())); 43 SuperCar *S = new SuperCar(); 44 directory.push_back(Data<string, Car*>(\"Diablo\", S)); 45 S = new SuperCar(); 46 Data<string, Car*> D(\"Gallardo\", S); 47 directory.push_back(D); 48 vector<Data<string, Car*> >::iterator it = directory.begin(); 49 for (; it != directory.end(); it++) { 50 cout << *it; 51 } 52 Vehicle V; 53 V.start(*S); 54 return 0; 55 } Page 8 of 32 CS103 - Computer Programming Spring 2018 Final Exam Solution: 1 Mehran 2 The car is started 3 Diablo 4 The SuperCar is started 5 Gallardo 6 The SuperCar is started 7 The vehicle is started 8 The SuperCar is started Page 9 of 32 CS103 - Computer Programming Spring 2018 Final Exam (k) (15 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. Hint: you can draw an hierarchy to make your task easy. 1 #include<iostream> 2 using namespace std; 3 class Hobbits { 4 public: 5 virtual void Function1() { 6 cout << \" Cp's Hobbitsess \" << endl; 7 } 8 void Function2() { 9 cout << \" Enjoy Programming \" << endl; 10 } 11 }; 12 class Gollum: public Hobbits { 13 public: 14 virtual void Function3() { 15 cout << \" Gollum 3\" << endl; 16 } 17 }; 18 class Bilbo: public Hobbits { 19 public: 20 virtual void Function1() { 21 cout << \" Bilbo 1\" << endl; 22 } 23 virtual void Function2() { 24 cout << \" Bilbo 2\" << endl; 25 } 26 }; 27 class Frodo: public Bilbo { 28 public: 29 void Function1() { 30 cout << \" Frodo 1\" << endl; 31 Hobbits::Function1(); 32 } 33 void Function2() { 34 cout << \" Frodo 2\" << endl; 35 } 36 void Function3() { 37 cout << \" Frodo 3\" << endl; 38 } 39 }; 40 41 int main() { 42 Hobbits *var1 = new Frodo; 43 Hobbits *var2 = new Bilbo; 44 Bilbo *var3 = new Frodo; 45 Hobbits &var4 = *var3; 46 Gollum",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2628,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "<< endl; 35 } 36 void Function3() { 37 cout << \" Frodo 3\" << endl; 38 } 39 }; 40 41 int main() { 42 Hobbits *var1 = new Frodo; 43 Hobbits *var2 = new Bilbo; 44 Bilbo *var3 = new Frodo; 45 Hobbits &var4 = *var3; 46 Gollum g; 47 Hobbits &var5 = g; 48 Frodo *f = new Frodo; 49 var1->Function1(); Page 10 of 32 CS103 - Computer Programming Spring 2018 Final Exam 50 var1->Function2(); 51 var2->Function1(); 52 var2->Function2(); 53 var3->Function1(); 54 var3->Function2(); 55 var4.Function1(); 56 var4.Function2(); 57 var5.Function1(); 58 var5.Function2(); 59 g.Function1(); 60 g.Function2(); 61 g.Function3(); 62 f->Function1(); 63 f->Function2(); 64 f->Function3(); 65 } Page 11 of 32 CS103 - Computer Programming Spring 2018 Final Exam Solution: 1 Frodo 1 2 Cp's Hobbitsess 3 Enjoy Programming 4 Bilbo 1 5 Enjoy Programming 6 Frodo 1 7 Cp's Hobbitsess 8 Frodo 2 9 Frodo 1 10 Cp's Hobbitsess 11 Enjoy Programming 12 Cp's Hobbitsess 13 Enjoy Programming 14 Cp's Hobbitsess 15 Enjoy Programming 16 Gollum 3 17 Frodo 1 18 Cp's Hobbitsess 19 Frodo 2 20 Frodo 3 Page 12 of 32 CS103 - Computer Programming Spring 2018 Final Exam (l) (15 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. 1 #include<iostream> 2 using namespace std; 3 class H { 4 public: 5 H() {cout << \" H-C \";} 6 ˜H() {cout << \" H-D \";} 7 }; 8 class E { 9 public: 10 E() {cout << \" E-C \";} 11 virtual ˜E() {cout << \" E-D \";} 12 }; 13 class F: public E { 14 public: 15 F() {cout << \" F-C \";} 16 ˜F() {cout << \" F-D \";} 17 }; 18 class A { 19 private: 20 H h; 21 E * ep; 22 public: 23 A(E *t) : ep(t) {cout << \" A-C \";} 24 virtual ˜A() { 25 cout << \" A-D \"; 26 delete ep; 27 } 28 }; 29 class B:public A { 30 private: 31 H h2; 32 public: 33 B(E *t) : A(t) {cout << \" B-C \";} 34 virtual ˜B() {cout << \" B-D \";} 35 }; 36 int main() { 37 A a(new E); 38 cout<<endl<<\" 1 2 3 \"<<endl; 39 B b(new F); 40 cout<<endl<<\" 1 2 3 \"<<endl; 41 B b2(new F); 42 cout<<endl<<\" 1 2 3 \"<<endl; 43 } Page 13 of 32 CS103 - Computer Programming Spring 2018 Final Exam Solution: 1 E-C H-C A-C 2 1 2 3 3 E-C F-C H-C A-C H-C B-C 4 1 2 3 5 E-C F-C H-C A-C H-C B-C 6 1 2 3 Page 14 of 32 CS103 - Computer Programming Spring 2018 Final Exam 7 B-D H-D A-D F-D E-D H-D B-D H-D A-D F-D E-D H-D A-D E-D H-D ,→ Page 15 of 32 CS103 - Computer Programming Spring 2018 Final Exam (m) (8 Marks) What will the following program display on screen. Explain the logical error or bug if",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2516,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "2018 Final Exam 7 B-D H-D A-D F-D E-D H-D B-D H-D A-D F-D E-D H-D A-D E-D H-D ,→ Page 15 of 32 CS103 - Computer Programming Spring 2018 Final Exam (m) (8 Marks) What will the following program display on screen. Explain the logical error or bug if there is any. Please note that there are no syntax errors in the program.. 1 #include<algorithm> 2 #include<iostream> 3 using namespace std; 4 template<typename T> 5 class Matrice { 6 public: 7 Matrice(int r, int c) : 8 rows(r), columns(c), ptr(new T[r * c]) {} 9 ˜Matrice() { 10 cout << *this; 11 delete[] ptr; 12 } 13 template<typename S> 14 void operator=(S *lmat) { 15 for(int i=0; i<rows*columns;++i) 16 ptr[i]=lmat[i]; 17 } 18 T &operator()(int i, int j) { 19 return ptr[j + i * columns]; 20 } 21 T &operator[](int i) { 22 return ptr[i]; 23 } 24 int GetRows() { 25 return rows; 26 } 27 int GetCols() { 28 return columns; 29 } 30 private: 31 int rows, columns; 32 int *ptr; 33 }; 34 template<typename T> 35 ostream& operator <<(ostream& cout, Matrice<T>& m) { 36 cout << \" Matrix = \" << endl; 37 for (int i = 0; i < m.GetRows() * m.GetCols(); ++i) { 38 cout << m[i] << \" \"; 39 if ((i + 1) % m.GetCols() == 0) 40 cout << endl; 41 } 42 return cout; 43 } 44 int main() { 45 int a[] = { 10, 20, 30, 40, 50, 60, 70, 80 }; 46 Matrice<int> v(4, 2); 47 v = a; 48 int z = ++v(2, 1); 49 cout << \" Z= \" << z << endl; 50 } Page 16 of 32 CS103 - Computer Programming Spring 2018 Final Exam Solution: 1 Z= 61 2 Matrix = 3 10 20 4 30 40 5 50 61 6 70 80 Solution: Segmentation Fault; 1 2 3 4 5 6 6 6 6 6 Page 17 of 32 CS103 - Computer Programming Spring 2018 Final Exam Question II . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (15 Marks) (a) (15 Marks) Write a recursive method called parenthesize that takes a String and an integer n as parameters and that prints the string inside n sets of parentheses. For example, this code: 1 parenthesize(\"CP\", 2); 2 parenthesize(\"FAST University\", 6); 3 parenthesize(\"final-exam\", 1); should produce these 3 lines of output: ((CP)) ((((((FAST University)))))) (final-exam) Solution: 1 #include<iostream> 2 #include<algorithm> 3 #include<iterator> 4 #include<vector> 5 using namespace std; 6 void writeSquares(int n) { 7 if (n <= 1) { Page 18 of 32 CS103 - Computer Programming Spring",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2382,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 5
    }
  },
  {
    "text": "parenthesize(\"FAST University\", 6); 3 parenthesize(\"final-exam\", 1); should produce these 3 lines of output: ((CP)) ((((((FAST University)))))) (final-exam) Solution: 1 #include<iostream> 2 #include<algorithm> 3 #include<iterator> 4 #include<vector> 5 using namespace std; 6 void writeSquares(int n) { 7 if (n <= 1) { Page 18 of 32 CS103 - Computer Programming Spring 2018 Final Exam 8 cout << n << \",\"; 9 return; 10 } 11 12 if (n % 2 == 0) { 13 14 writeSquares(n - 1); 15 cout << n * n << \", \"; 16 } else { 17 cout << n * n << \", \"; 18 writeSquares(n - 1); 19 } 20 21 } 22 int main() { 23 writeSquares(5); 24 cout << endl; 25 writeSquares(1); 26 cout << endl; 27 writeSquares(8); 28 cout << endl; 29 } Page 19 of 32 CS103 - Computer Programming Spring 2018 Final Exam Extra Sheet Page 20 of 32 CS103 - Computer Programming Spring 2018 Final Exam Question III . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (15 Marks) (a) (15 Marks) Suppose there is a Vehicle Plate Recognition System installed at Golra Mor that captures im- ages of cars and recognizes their numbers. It stores all the numbers in a new text ﬁle everyday. Suppose the authorities have another text ﬁle containing all the possible initials of every city (such as Islamabad is represented by IDD and IDH, Lahore by LHY and LHE, etc. in this ﬁle). Now Your task is to write code for counting the number of vehicles of each city that passed Golra Mor on a particular day. You are provided 2 text ﬁles: one carrying all the used initials of every city and the other carrying identiﬁed numbers of the day. Sample input ﬁles and output are shown below: File cities.txt content is as follows: City Initial Islamabad IDD Lahore LHY Islamabad IDH Lahore LHE File May16.txt content is as follows, where each line contains number of vehicle: LHY 2140 LHY 2202 IDD 516 LHE 888 Your program should read both the ﬁles and write a new ﬁle named output.txt containing the name of each city and number of vehicles with that city number plate passed on that day. For example, for above given output following should be content of your ﬁle output.txt: Islamabad 1 Lahore 3 You can make this task fairly easy by using STL Page 21 of 32 CS103 - Computer Programming Spring 2018 Final Exam Extra Sheet Page 22 of 32 CS103 - Computer Programming Spring 2018 Final Exam Question IV. . . . . . . . . . . . . . . . . .",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2475,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 6
    }
  },
  {
    "text": "fairly easy by using STL Page 21 of 32 CS103 - Computer Programming Spring 2018 Final Exam Extra Sheet Page 22 of 32 CS103 - Computer Programming Spring 2018 Final Exam Question IV. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .(15 Marks) (a) (15 Marks) Your goal is to write a class Set that will be used to build set of integers (you can make it generic if you want). Remember that a set only contains unique items. Now given following code segments, ﬁrst identify all the basic functions and operators you need, and then write these functions. 1 int a[] = { 1, 3, 3, 2, 5 }; 2 Set s1(a, 5); // set initalized using an array with 5 elements 3 s1 + 4; // add a new item to the set 4 s1 - 3; // remove 3 from the set. 5 6 Set s2(a, 5); // set initalized using an array with 5 elements 7 if (s2 == s1) 8 cout << \" Both Sets are equal\"; 9 10 Set s3; 11 s3 = s1 & s2; // intersection of s1 and s2 12 13 Set s4; 14 s4 = s1 | s2; // union of s1 and s2 15 16 cout << s1 << \" \" << s2 << \" \" << s3 << \" \" << s4 << endl; Page 23 of 32 CS103 - Computer Programming Spring 2018 Final Exam Page 24 of 32 CS103 - Computer Programming Spring 2018 Final Exam Page 25 of 32 CS103 - Computer Programming Spring 2018 Final Exam Question V . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (35 Marks) Please read and understand the question carefully before proceeding with design and code writing. You are going to build a minimal Bill Management System (BMS) for a Chemist store like Shaheen Chemists. The developed system will be used for managing the bills of sold items. Each bill will be issued to a customer, a customer can be either a registered user of the store or can be a non-registered user. The system will be used to sell following types of Items: Medicines and Cosmetics. Each sold medicine will have a",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2032,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 7
    }
  },
  {
    "text": "the bills of sold items. Each bill will be issued to a customer, a customer can be either a registered user of the store or can be a non-registered user. The system will be used to sell following types of Items: Medicines and Cosmetics. Each sold medicine will have a unique number, name, price, quantity, and description of disease for which it has been prescribed. Similarly, each sold cosmetic item will have unique number, name and price. Chemist store will be selling two types of cosmetics, local and imported. Local cosmetics will be liable to 17% GST, that is their price will be calculated by including 17% GST on the listed price. Imported cosmetics will have 17% GST and 4% VAT (value added tax). Furthermore, each imported cosmetic item will have its country of origin listed in the bill. A registered user will have a unique-id, his email and phone number along with total number of bonus points it has accumulated. The chemist store gives special discount to its registered members on each bill. Thus while buying if the customer provides his valid membership-id then store will give him 1% discount on the total price. Furthermore, a registered user accumulates 100 bonus points if he buys items of price more than 500. On accumulating 1000 bonus points, a registered user is given further 5% discount on his bill, and his bonus account is reset to zero. If the customer is not registered and wants to have an account with then the system asks him to register himself by providing his name, city, joining date (string). Your designed system will be used to manage the bills for sold items and generate total bill after calculating all the sold items in a single bill by incorporating all the taxes and discounts. Furthermore, your designed system shall maintain all bills in a list. At any time, system can calculate the total sales amount by adding the total amount of each bill. You can use STL-containers to simplify your task. (a) (10 Marks) Build a hierarchical diagram of your system by identifying the main classes and the relationships among them. Page 26 of 32 CS103 - Computer Programming Spring 2018 Final Exam (b) (15 Marks) Write the complete code for all the classes (except main) of your BMS system, including set- ters/getters (where required), constructor(s) and destructor(s) in addition to the other functions (such as print bill, calculate item price) as discussed above. Page 27 of 32 CS103 - Computer Programming Spring 2018 Final Exam Page 28 of 32 CS103 - Computer Programming Spring 2018 Final Exam Extra Sheet Page 29 of 32 CS103 - Computer Programming Spring 2018 Final Exam (c) (10 Marks) Given the classes of your system, now create a function name Generate Bill in your main class that calculates the total price from all the items in the bill. It is a must that you use polymorphism (You can also use STL containers, of course if you wish) to calculate total bill amount . 1 Bill b; 2 // some other code",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2949,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 8
    }
  },
  {
    "text": "Bill in your main class that calculates the total price from all the items in the bill. It is a must that you use polymorphism (You can also use STL containers, of course if you wish) to calculate total bill amount . 1 Bill b; 2 // some other code here 3 4 // finally; 5 b.Generate_Bill(); // should compute the total price of all the items Page 30 of 32 CS103 - Computer Programming Spring 2018 Final Exam Extra Sheet Page 31 of 32 CS103 - Computer Programming Spring 2018 Final Exam Extra Sheet Page 32 of 32",
    "chunk_type": "generic",
    "word_count": 99,
    "char_count": 510,
    "source_document": "PF Final-Exam Spring 2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 9
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 1 of 21 ____________ ______________ ___________________ _____________________ Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. Please read the complete paper before attempting any question and manage your time intelligently. 3. After asked to commence the exam, please verify that you have Twenty one (21) different printed pages including this title page. There are total of 3 questions. 4. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 5. Use proper Syntax while writing code and make sure that your code is legible. Failing to do so can cost you marks. Q-1 Q-2 Q-3 Total Marks Obtained Total Marks 60 30 30 120 Serial No: Final EXAM Total Time: 180 Minutes Total Marks: 120 ________________ Signature of Invigilator CS118 Programming Fundamentals Friday May 17, 2019 Course Instructor National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 2 of 21 Question I ….......………………..…………………………………………..……..………… (60 Marks) Write the output of the given C++ code segments. Please note there are no syntax errors in the given set of codes. 1) What will be the output of the following code? [2] int main() { int z = 5, j = 7, k = 6, n = 3; cout << z + j % k + k * n - 15 << endl; cout << z % n + 5 << endl; return 0; } 2) What is the output of variable counter in the following code? [2] int i = 12, counter = 5; while ((i - 1)) { ++counter; i--; } cout<<counter; 3) What is the output of the following code? [4] int fun(int m, int n) { while (n != m) { if (n > m) n = n - m; else if (m > n) m = m - n; } return n; } int main() { cout << fun(88, 33) << endl; cout << fun(172,140)<<endl; return 0; } What is the purpose of above function fun()? National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 3 of 21 4) What is the output of the following code? [2] void main() { int x = 5; int y = 10; int z = ++x * y--; cout<<(z+y); } 5) What is the output of the following code? [2] void main() { int y = 981; if(y % 4 == 0 && y % 100 != 0 || y % 400 == 0) cout<<\"Condition is True\"; else cout<<\"Not True\"; } 6) What is the output of the following code? [2] void main() { int z, x=5, y=-10, a=4, b=2; z = x++ - --y * b / a; cout<<z; } 7) What is the output of the following code? [2] void main() { int a =",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2664,
    "source_document": "PF Final-Exam Spring 2019.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "else cout<<\"Not True\"; } 6) What is the output of the following code? [2] void main() { int z, x=5, y=-10, a=4, b=2; z = x++ - --y * b / a; cout<<z; } 7) What is the output of the following code? [2] void main() { int a = 10, b = 0xFF; b = a++ - a++; cout << ++b; } 8) What is the output of the following code? [2] int x=10; void main() { int x=20; cout<<::x++; cout<<x+::x; } National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 4 of 21 9) What is the output of the following code? [2] void main() { int i=0, n = 0; if ((i < 1) && (++i < n)) { cout << \"Condition True!\"; } else cout << \"Not True!\"; } 10) What will be the output of the following code? [3] int counter (int value) { static int count =0; count = count +value;; return count; } int main() { int i , j; for (i=0; i <=5; i++) j = counter(i); cout<<\"J =\" <<j<<endl; return 0; } 11) What will be the output of the following code? [4] int mystery(int x, int n) { int val; val = 1; if (n >= 0) { if (n % 3 > 1) val = val * x; else val = val * 2; } return val; } void main() { cout << \"The mysterious value is: \" << mystery(10, 3); } National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 5 of 21 12) What will be the output of the following code? [2] int main() { int a[5] = { 1,2,3,4,5 }; int *ptr = a + 5; cout << *(a + 1) << \" , \" << *(ptr - 1); return 0; } 13) What will be the output of the following code? [3] void function(int b[][3]) { ++b; b[1][1] = 9; } int main() { int a[3][3] = { { 1,2,3} , { 4,5,6} , {7,8,9} }; function(a); cout << a[2][1]; return 0; } 14) What will be the output of the following code? [3] void e(int n) { static int x = 3; if (n > 0) cout << n << \" \"<< x<<endl; n--; x--; } int main() { int a; a = 10; e(a--); e(a--); e(a--); } National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 6 of 21 15) What will be the output of the following code? [5] void f1(int *, int*); void f2(int *, int); int main() { int a; int b; a = 3; b = 5; f1(&a, &b); cout << a << \",\" << b << \",\"; f2(&a, b); cout << a << \",\" << b; } void f1(int* p, int *q) { int tmp; tmp = *p; *p = *q; *q = tmp; } void f2(int* p, int q) { int tmp; tmp = *p; *p = q; q = tmp; } 16) What will be the output of the",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2325,
    "source_document": "PF Final-Exam Spring 2019.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "a << \",\" << b; } void f1(int* p, int *q) { int tmp; tmp = *p; *p = *q; *q = tmp; } void f2(int* p, int q) { int tmp; tmp = *p; *p = q; q = tmp; } 16) What will be the output of the following code? [4] int main() { int i, j, m, answer; m = 0; j = 4; while (m < 5) { for (i = 0; i < j; i++) { answer = i * m; cout << answer; } m = m + 1; cout << endl; } return 0; } National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 7 of 21 17) What will be the output of the following code? [4] int main ( ) { char *s[4] = {\"black\", \"white\", \"yellow\", \"violet\"}; cout<<(*(s+1)+2)<<endl; cout<<*(*(s+2)+3); return 0; } 18) What is the value of Arr[7][9]; in the sample code below? [4] void main() { int i, j; int counter = 0; int Arr[8][9]; for (i = 0; i < 9; i++) for (j = 0; j < 8; j++) { Arr[j][i] = counter; ++counter; } cout << Arr[7][8]; } 19) What is the output of the following code? [4] #include <iostream> #include <cstring> using namespace std; int main() { char s1[20] = \"Final \"; char s2[] = \"Examination \"; cout << \"s1 = \" << s1 << \"\\ns2 = \" << s2; strncat(s1, s2, 6); cout << \"\\nS1 = \" << s1 << \" S2= \" << s2 ; return 0; } National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 8 of 21 20) What is the output of the following code? [4] int check1(char *x, char *y) { return strcmp(x,y); } int check2(char *x, char *y) { return strncmp(x,y,3); } int main() { char e1[] = \"Alpha\"; char e2[] = \"Bravo\"; char e3[] = \"Alpak\"; cout<<check1(e1, e2)<<endl; cout<<check1(e1, e1)<<endl; cout<<check2(e1, e3)<<endl; return 0; } National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 9 of 21 Question II ….......………………..……………………………….……..……….. (20 + 10 = 30 Marks) A) Select appropriate option. (MCQ’s) [20 X 1 =20] 1. Which one of the following C++ operators is right associative? a) = b) , c) [] d) ^ e) ?: 2. What will the output of the sample code be? int arr[10] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}; int *ptr = arr + 2; cout<<ptr[ 7 ]; a) 6 b) 7 c) 8 d) 9 3. What will be printed when the sample code above is executed? char *buffer = \" Hello World\"; char *ptr = buffer; ptr += 5; cout<<ptr<<endl; cout<<buffer; a) HelloWorld World b) World WelloWorld c) World World d) HelloWorld HelloWorld e) World HelloWorld 4. What value does testarray[2][1][0] in the sample code contain? int testarray[3][2][2] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}; a) 3 b) 5 c) 7 d) 9 e) 11 National University of Computer and Emerging",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2563,
    "source_document": "PF Final-Exam Spring 2019.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "c) World World d) HelloWorld HelloWorld e) World HelloWorld 4. What value does testarray[2][1][0] in the sample code contain? int testarray[3][2][2] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12}; a) 3 b) 5 c) 7 d) 9 e) 11 National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 10 of 21 5. Consider implementing a function to dynamically allocate an array of integers and set all its elements to zero: Which of the following choices for the blank preceding the formal parameter A is best? a) int* b) int* const c) int*& d) const int* const e) const int* 6. Not initializing variables in a C++ program can lead to _______________. a) syntax errors b) logic errors c) linking errors d) runtime errors 7. Array passed as an argument to a function interpreted as ___________________. a) value of the first element of the array b) address of the first element of the array c) number of elements of the array d) size of the array in bytes 8. The portion of a function prototype that includes the name of the function and the types of its arguments is called the ______________________. a) function header b) function call c) function signature d) function parameter list 9. A ___________________ should be used to declare the size of an array because it makes the program more scalable. a) constant variable b) local variable National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 11 of 21 c) null character d) pointer variable 10. The naming conflict arising from the definition of variables with same names in different scopes has been solved in C++ using ___________________. a) scope resolution operator b) type casting c) storage classes d) namespaces) 11. The compiler refers to the _____________ to check that calls to that function are correct in terms of the number, type and order of the arguments that the function takes. a) function header b) function definition c) function parameter list d) function prototype 12. Global variables declarations are placed __________________________. a) Inside a block b) outside all function definitions but inside main c) outside any function definition d) outside the headers of control statements 13. In C++, an empty parameter list is specified by writing either void or ____________________. a) Nothing in parentheses b) NULL in parentheses c) 0 in parentheses d) omitting the parentheses 14. A function receiving an address as an argument must have a/an __________________ as its corresponding parameter. a) Identifier National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 12 of 21 b) single dereferenced value c) static variable d) pointer For questions 15 to 19, refer to the following code segment; # include <iostream> using namespace std; f_1(); f_2(int,int); f_3(); f_4(int); main() { int x=6; //Line 1 f_1(); //Line 2 f_3(); //Line 3 f_4(x); //Line 4 } f_1() { int x=7, int y=5; f_2(x,y); } f_2(int x, int y) { cout<<\"X is \"<<x<<\" and Y is \"<<y<<\" in function f_1().\"<<endl;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 3083,
    "source_document": "PF Final-Exam Spring 2019.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "segment; # include <iostream> using namespace std; f_1(); f_2(int,int); f_3(); f_4(int); main() { int x=6; //Line 1 f_1(); //Line 2 f_3(); //Line 3 f_4(x); //Line 4 } f_1() { int x=7, int y=5; f_2(x,y); } f_2(int x, int y) { cout<<\"X is \"<<x<<\" and Y is \"<<y<<\" in function f_1().\"<<endl; f_3(); } f_3() { static int x=5; cout<<\"A static X found in one of the functions with the value \"<<x<<\".\"<<endl; x++; f_4(x); } f_4(int x) { cout<<\"Value of X in f_4() is \"<<x<<\".\"<<endl; } National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 13 of 21 15. The variable ‘x’ defined in Line 1 has; a) global scope since it is defined outside the functions’ f_1, f_2,f_3 and f_4 bodies b) function prototype scope since it is used in calling function f_4 c) file scope since it is known in all functions of the file d) local scope since it is defined inside the body of main 16. How many activation records will be pushed onto the function call stack as a result of execution of Line 2? a) One b) Two c) Three d) Four 17. During execution of Line 2, after two activation records have been popped off the function call stack, the stack top will contain the activation record of; a) f_1 b) f_2 c) f_3 d) f_4 18. During execution of Line 3, the following statement will be printed on screen; a) A static X found in one of the functions with the value 5. b) A static X found in one of the functions with the value 6. c) A static X found in one of the functions with the value 7. d) A static X found in one of the functions with the value 8. 19. When this program is executed, six statements will be printed on screen. Which two statements will be identical? a) Statements 2 and 4 b) Statements 3 and 5 c) Statements 3 and 6 d) Statements 5 and 6 20. An array is a consecutive group of memory locations that all have the same address that is the name of the array. a) True b) False National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 14 of 21 B) Identify what’s wrong with the following set of code segments and correct it. Please assume that all variables have been defined. [10] I. int main() { const double PI; int n; PI = 3.14159265358979; return 0; } II. while (n <= 100) sum += n*n; III. float x = 3.14159; float* p = &x; short d = 44; short* q = &d; p = q; IV. if ( response = \"yes\" or \"YES\" ) cout << \"You said yes.\"; V. if (x < y < z) cout << x << \" < \" << y << \" < \" << z << endl; National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 15 of 21 Question III ….......………………..…………………...……..……..……….. (10 + 10 + 10 =",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2668,
    "source_document": "PF Final-Exam Spring 2019.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "if (x < y < z) cout << x << \" < \" << y << \" < \" << z << endl; National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 15 of 21 Question III ….......………………..…………………...……..……..……….. (10 + 10 + 10 = 30 Marks) A) Write a complete C++ code that inputs a character array (string) from a user. After taking input it calls a function Reverse() that reverses the string word by word as shown below: Original Character Array: Raining in summers makes your life pretty After calling Function Reverse(): pretty life your makes summers in Raining Note: You have to use pointers in the function. You can use any builtin Cstring function of your choice for this task. National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 16 of 21 National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 17 of 21 B) Write a function highLow that takes an integer as an argument and returns whether or not the number has alternating “high” and “low” digits. 0 through 4 are “low” digits and 5 through 9 are “high” digits. Your function should return true if the number passed alternates between “high” and “low” digits, and false if not. You may assume the number passed is positive. If the number passed consists of a single digit, highLow should return true. Note: highLow returns true if the number alternates starting with a “high” digit or starting with a “low” digit. What is important is that the digits alternate. For example, both 9292 and 2929 passed to highLow should return true. National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 18 of 21 National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 19 of 21 C) Write a function named reverseChunks that accepts three parameters, an array of integers a, its size and an integer \"chunk\" size s, and reverses every s elements of a. For example, if s is 2 and array a stores {1, 2, 3, 4, 5, 6}, a is rearranged to store {2, 1, 4, 3, 6, 5}. With an s of 3 and the same elements {1, 2, 3, 4, 5, 6}, array a is rearranged to store {3, 2, 1, 6, 5, 4}. The chunks on this page are underlined for convenience. If a's length is not evenly divisible by s, the remaining elements are untouched. For example, if s is 4 and array a stores {5, 4, 9, 2, 1, 7, 8, 6, 2, 10}, a is rearranged to store {2, 9, 4, 5, 6, 8, 7, 1, 2, 10}. It is also possible that s is larger than a's entire length, in which case the array is not modified at all. You may assume that s is 1 or greater (an s of 1 would not modify the array). If array a is empty, its contents should remain unchanged. The following table",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2773,
    "source_document": "PF Final-Exam Spring 2019.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 5
    }
  },
  {
    "text": "possible that s is larger than a's entire length, in which case the array is not modified at all. You may assume that s is 1 or greater (an s of 1 would not modify the array). If array a is empty, its contents should remain unchanged. The following table shows some calls to your method and their expected results: Arrays and Call Array Contents After Call int a1[] = {20, 10, 30, 60, 50, 40}; reverseChunks(a1,6, 2); {10, 20, 60, 30, 40, 50} int a2[] = {2, 4, 6, 8, 10, 12, 14, 16}; reverseChunks(a2,8, 3); {6, 4, 2, 12, 10, 8, 14, 16} Int a3[] = {7, 1, 3, 5, 9, 8, 2, 6, 4, 10, 0, 12}; reverseChunks(a3,12, 5); {9, 5, 3, 1, 7, 10, 4, 6, 2, 8, 0, 12} int a4[] = {1, 2, 3, 4, 5, 6}; reverseChunks(a4,6, 8); {1, 2, 3, 4, 5, 6} int a5[]= {}; reverseChunks(a5,0, 2); {} National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 20 of 21 National University of Computer and Emerging Sciences School of Computing Spring 2019 Islamabad Campus Page 21 of 21 Rough Work",
    "chunk_type": "generic",
    "word_count": 195,
    "char_count": 1011,
    "source_document": "PF Final-Exam Spring 2019.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 6
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 2 of 10 30 5 Q. No. 1 (a) What is the output of the following pseudo code: x = 5; Dry run: y = 4; z = 0; while x > 0 z = x + y x = x - 1 y = y + 2 end while print z Output: (b) What is the output of the following pseudo code: x = 10; Dry run: y = 1; z = 0; while x > 0 if x - y > 0 z = z + 5 else z = z - 5 end if x = x - 2; y = y + 2; end while print z 5 National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 3 of 10 10 10 Output: (c) What is the output of the following pseudocode: Assume that Arr is an array (list) that contains the following elements: 1 2 3 4 5 6 7 8 9 10 17 10 9 13 25 4 22 11 13 12 Notice that the index (offset) begin from position 1. More clearly, Arr[1] is 17, Arr[9] is 13, Arr[10] is 12, etc. i = 1 j = 10 while i<=10 temp = Arr[i] Arr[i] = Arr[j] Arr[j] = temp i = i+1 j = j-1 end while i=1 while i<=10 print Arr[i] end while Output: National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 4 of 10 20 (d) What is the output of the following pseudocode: i = 10 k = 0 while i>0 j = i while j>0 k = k+j j = j-2 end while i = i - 1 end while print k Output: National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 5 of 10 2 2 3 3 5 Q. No. 2 a) Write an if statement that assigns 100 to x when y is equal to 0. b) Write an if/else statement that assigns 0 to x when y is equal to 10. Otherwise it should assign 1 to x. c) Write an if statement that assigns 1 to x if the variable grade is within the range 0 through 100. d) Write an if statement that assigns 0 to x if the variable hours is outside the range 0 through 80. e) Write a while loop that displays the following set of numbers: 0, 10, 20, 30, 40, 50 . . . 1000 National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 6 of 10 5 f) Write a nested while loop that displays 10 rows of '#' characters. There should be 15 '#' characters in each row. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 7 of 10 10 Q. No. 3 Write a program that lets the user enter 10 values into an array (list). The program should then",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2360,
    "source_document": "PF Mid-1 Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "characters. There should be 15 '#' characters in each row. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 7 of 10 10 Q. No. 3 Write a program that lets the user enter 10 values into an array (list). The program should then display the largest and smallest values stored in the array (list). National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 8 of 10 10 Q. No. 4 The arrays (lists) numberArray1 and numberArray2 have 100 elements. Write code that copies (assigns) the values in numberArray1 to numberArray2. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 9 of 10 10 Q. No. 5 The area of a rectangle is the rectangle's length times its width. Write a function that receives two arguments: length and width of the rectangle and returns the area. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 10 of 10 20 Q. No. 6 Write a program that reads two numbers (x and y) as input and outputs the remainder when the first is divided by the second (i.e. x % y) using only addition and subtraction. Note: You are NOT allowed to use the %, mod, or other remainder operators.",
    "chunk_type": "generic",
    "word_count": 223,
    "char_count": 1291,
    "source_document": "PF Mid-1 Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 1 of 10 ____________ ______________ ___________________ _____________________ Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. Please read the complete paper before attempting any question and manage your time intelligently. 3. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 4. If you need more space write on the back side of the paper and clearly mark question and part number etc. 5. After asked to commence the exam, please verify that you have ten (10) different printed pages including this title page. There are total of 5 questions. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. Make a smiley on front page and earn four bonus marks. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. Q-1 Q-2 Q-3 Q-4 Q-5 Total Marks Obtained Total Marks 30 30 10 10 10 100 Vetted By: _____________________________Vetter Signature: _____________________ Serial No: Mid I Total Time: 1 Hour Total Marks: 100 ________________ Signature of Invigilator CS101 Introduction to Computing Monday, September 29, 2014 Course Instructor Dr. Sibt ul Hussain, Dr. Hassan Mujtaba, Miss Uzma Marooof National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 2 of 10 30 Q. No. 1 (a). For each expression at left, indicate its value in the right column. List a value of appropriate type. e.g., 7 for an integer, 7.0 for a real, \"hello\" for a String, True or Talse for a boolean or write error if there is any. Expression Value 3 * -1 + 7 - 5 / 2 2 + 2 + \"(2 + 2)\" + 2 + (2 + 2) 13 / 3 - 27 / 5 * 0.5 + (7.5 - 6) 2 % 11 % 2 + 11 % 2 + 2 (5 / 3 == 1 and 10 < 4 + 5) != false (b) For each run and input below, write the output that is produced. Dry run: n=input(‘Enter an Integer: ’) x = 1; y = 1; while n > y : x= x+1 y = 10 * y + x print x, ‘ ‘, y Run 1 Enter an Integer:32 Output: 5 10 National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 3 of 10 5 Run 2: Enter an Integer:256 Output: (c) What is the output of the following pseudo code: Dry run: x = 1 y = 2 n=12 while (y < n) : if (n % y == 0) : n = n / y x=x+1 else : y=y+1 print x, ' ', n Output: National University of Computer and Emerging",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2665,
    "source_document": "PF Mid-1 Fall-2014.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "is the output of the following pseudo code: Dry run: x = 1 y = 2 n=12 while (y < n) : if (n % y == 0) : n = n / y x=x+1 else : y=y+1 print x, ' ', n Output: National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 4 of 10 10 (d) What is the output of the following pseudocode: k=4 z=0 i=1 while i <= k: z=z+i i=i+1 while k >=1: j=1 while j <= k: print z-k+j, j=j+1 z=z-k print ‘\\n’ k=k-1 Output: National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 5 of 10 30 2 2 2 3 5 Q. No. 2 a) Write an if statement that assigns -20 to x when y is greater or equal to 0. b) Write an if/else statement that assigns 0 to y when x is equal to “10.22”. Otherwise it should assign 1 to x. c) Write an if statement that assigns “Fail” to x if the variable grade is within the range -10 through 10 (inclusive). d) Write an if statement that assigns 0 to x if the variable hours is outside the range 10 through 60. e) Write a while loop that displays the first 20 elements of the following sequence: 5, 6, 8, 11, 15, 20, 26, 33, … National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 6 of 10 5 5 f) Write a while loop that displays the following sequence: 256, 128, 64, 32, 16, 8, 4, 2, 1 g) Write a nested while loop that displays 5 rows of '@' characters. There should be 9 '@' characters in each row. National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 7 of 10 6 h) What will be the output of following statements, write errors if they results in syntax error. Please write your output in the second column. Code Output x=5 y=10 print X+y 1j=5 y=10 print 1j + y z=5 w=10 print z , * , w, =, x*y a=10 b=20 print a++b * a--b cccc=10 dddd=10 print cccc---dddd++cccc a=90 b=90 c=80 d=81 print (a+b+c+d)/4 National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 8 of 10 10 Q. No. 3 Write a program that lets the user enter 10 values only once. The program should then display the largest and smallest values as well as the total number of evens and odds in the input values. National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 9 of 10 10 Q. No. 4 Write the code that takes length as input and prints an inclined line of that size using ‘*’ characters. For example: Inclined line of length 6 * * * * * * Inclined line of length 5 * * * * * National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2635,
    "source_document": "PF Mid-1 Fall-2014.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "input and prints an inclined line of that size using ‘*’ characters. For example: Inclined line of length 6 * * * * * * Inclined line of length 5 * * * * * National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 10 of 10 10 Q. No. 5 Write a program that accepts a positive integer (or string) as input and then displays a new number obtained by replacing every pair of repeated adjacent digits by a single digit. For example, the integer 558834226 has three repeated adjacent digits: 55, 88 and 22. This means that your program should display the integer 583426 instead of (558834226). You may assume that no digit is repeated more than twice. Sample Run of Your Program: Input Expected Output 44223553 42353 346623 34623 121212 121212 0 0 8 8 44 4 You can also write this program using strings. If you use the strings then you should follow these guidelines. Your program should first ask the user who many digits will be there in the input. Then repeatedly take the inputs from the user and produce a final string by concatenating the non-repeated individual digits. Remember your algorithm must replace every pair of adjacent digits input by users by a single digit.",
    "chunk_type": "generic",
    "word_count": 217,
    "char_count": 1219,
    "source_document": "PF Mid-1 Fall-2014.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 1 of 11 ____________ ______________ ___________________ _____________________ Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. Please read the complete paper before attempting any question and manage your time intelligently. 3. No additional sheet will be provided for rough work. Use the back of the pages for rough work. 4. If you need more space write on the back side of the paper and clearly mark question and part number etc. 5. After asked to commence the exam, please verify that you have ten (10) different printed pages including this title page. There are total of 5 questions. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. Make a smiley on front page and earn four bonus marks. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. Q-1 Q-2 Q-3 Q-4 Q-5 Total Marks Obtained Total Marks 25 25 10 10 10 80 Vetted By: _________________________Vetter Signature: _____________________ Serial No: Mid I Total Time: 1 Hour Total Marks: 80 ________________ Signature of Invigilator CS101 Introduction to Computing Monday, September 14, 2015 Course Instructor Dr. Sibt ul Hussain, Dr. Abul Malik, Ms. Uzma Maroof National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 2 of 11 25 Q. No. 1 (a). For each expression at left, indicate its value in the right column. List a value of appropriate type. e.g., 7 for an integer, 7.0 for a real, \"hello\" for a String, True or Talse for a boolean or write error if there is any. (b) For each run and input below, write the output that is produced. Dry run: y =0 n = input(\"Enter an Integer: \") while n!=0: x=n%10 y=y*10+x n=n/10 print(y) Run 1 Enter an Integer: 452 Output: Expression Value -(6 + 3 - 2 * 3) 15 % 6 + 5 % 5 + 12 % 7 % 3 9 / 2 / 2.0 + 9 / 2.0 / 2 5 + 6 + 7 % 8**2**3 + 9 + 2 * 3 not(3 < 7 and -1 != 8) 31 / 2 / 10.0 + 10 / (5 / 2.0) 5 >= 5 * 6 + 2 or 9 > 4 * 5 (2.5 = 5 / 2.0) * 10 5 10 National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 3 of 11 5 Run 2: Enter an Integer: 1462 Output: (c) What is the output of the following pseudo code: Dry run: a=input('Enter a Number: ') b=input('Enter another Number: ') if a % 2 != 0: a = a * 2 if a > 10 : b=b+1; elif a < 10: a=a-1 b=b-1;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2681,
    "source_document": "PF Mid-1 Fall-2015 (Solution-Q2-Q3-Q4-Q5).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "Run 2: Enter an Integer: 1462 Output: (c) What is the output of the following pseudo code: Dry run: a=input('Enter a Number: ') b=input('Enter another Number: ') if a % 2 != 0: a = a * 2 if a > 10 : b=b+1; elif a < 10: a=a-1 b=b-1; print(str(a)+\" \"+str(b)) Runs Outputs Input for Run1: Enter a Number: 12 Enter another Number: 12 Output of Run1: Input for Run2: Enter a Number: 7 Output of Run2: National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 4 of 11 5 Enter another Number: 4 Input for Run3: Enter a Number: 5 Enter another Number: 8 Output of Run3: Input for Run4: Enter a Number: 3 Enter another Number: 42 Output of Run4: (d) What is the output of the following pseudocode: a=input('Enter a Number') b = 1 c = 0 while b <= a: if b % 2 == 0: c=c+1 b = b * 10 c=c+1 print( c + 1) Runs Outputs Input for Run1: Enter a Number: 4097 Output of Run1: Input for Run2: Enter a Number:388 Output of Run2: National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 5 of 11 25 3 2 2 5 Q. No. 2 a) Write an if statement for the following situation: If an integer variable currentNumber is multiple of 5, change its value so that it is now 3 times currentNumber plus 1, otherwise change its value so that it is now half of currentNumber. if currentNumber % 5 == 0: currentNumber = currentNumber*3 +1 else: currentNumber = currentNumber/2 b) Write an if/else statement to check the input given by the user in variable city is “Lahore” otherwise show him message that his input is wrong. if city != \"Lahore\": print \"Your input is wrong\" c) Write an if statement that assigns “High” to variable x if the variable grade is not in the following ranges [-10, 10] and [100, 1000] (inclusive). if not (-10 <= grade <= 10) and not (100 <= grade <= 1000): x = \"High\" d) Write a while loop that displays sum of the first n odd numbers: 1 + 3 + 5 + . . . + 2n − 1 … National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 6 of 11 5 3 sum = 0 counter = 1 NextNumber = 1 while counter <= n: sum = sum + NextNumber NextNumber = NextNumber + 2 counter = counter + 1 e) Write a while loop that displays the following sequence: 1, 4, 9, 16, 25, 36, 49, 64 counter = 1 while counter <= 8: print (counter**2 ,) counter = counter + 1 f) Write a while loop that finds number of times a whole number n can be divided by 4 (using integer division) before reaching 1. For instance, if user gives 10 as input the result should be 1 and if a user gives 64 as input the result should be 3.",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2607,
    "source_document": "PF Mid-1 Fall-2015 (Solution-Q2-Q3-Q4-Q5).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "Write a while loop that finds number of times a whole number n can be divided by 4 (using integer division) before reaching 1. For instance, if user gives 10 as input the result should be 1 and if a user gives 64 as input the result should be 3. n = input() counter = 0 while n >= 4: n =n//4 counter = counter + 1 print counter National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 7 of 11 10 5 g) What will be the output of following statements, write errors if they results in syntax error. Please write your output in the second column. Code Output x= ‘5’ y=10 print(x+y) Error Line 3: Can't convert 'int' to str True=5 z=20 print (True / z) Error Line 1 : Assignment to Keyword w=---5 q=20 print (-w*+q) 100 a=50 b=100 print(str(b%a)+\" \"+Str(a%400)+\" \") Error: name 'Str' is not defined a=5*8 b=8*5 e=a+b f=e/4 print(e) 80 Q. No. 3 The Syracuse (also called Collatz or Hailstone) sequence is generated by starting with a natural number (integer) and repeatedly applying the following function until reaching 1: For example, the Syracuse sequence starting with 5 is: 5, 16, 8, 4, 2, 1. National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 8 of 11 Now write a program that gets a starting value from the user and then prints the Syracuse sequence for that starting value. x = int(input()) while x != 1: print (x) if x%2 == 0: x = x/ 2 else: x = 3*x + 1 print (x) National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 9 of 11 10 Q. No. 4 Write the code (using a loop) that takes size of square as input and prints a square of that size using ‘*’ characters. Note you are only allowed to use a single loop. For example: Size = input() print ('*'*Size) line = 1 while line <= Size-2: print ('*'), print(' '*(Size-2)), print ('*') line = line + 1 print ('*'*Size) Solution 2: x=input('Please Enter size of Square: ') i=1 while i <= x: if i==1 or i==x: print x*'* ' else: print '* '+' '*(2*(x-2)-1)+' * ' i=i+1 National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 10 of 11 10 Q. No. 5 Write a program that accepts four integers hour1, minute1, hour2, and minute2 as inputs. Each pair of inputs represents a time on the 24-hour clock (for example, 1:36 PM would be represented as 13 and 36). The program should print \"you can take lunch\" if the gap between the two times is long enough to eat lunch: that is, if the second time is at least 45 minutes after the first time. Otherwise the program should print \"you can take your lunch\" You may assume that all parameter values are valid: the hours are both between 0 and 23, and the minute parameters are between 0 and 59.",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2776,
    "source_document": "PF Mid-1 Fall-2015 (Solution-Q2-Q3-Q4-Q5).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "is, if the second time is at least 45 minutes after the first time. Otherwise the program should print \"you can take your lunch\" You may assume that all parameter values are valid: the hours are both between 0 and 23, and the minute parameters are between 0 and 59. You may also assume that both times represent times in the same day, e.g. the first time won't represent a time today while the second time represents a time tomorrow. Note that the second time might be earlier than the first time; in such a case, your program should print \"Invalid Input\". Sample Run of Your Program: Enter First Hour: 11 Enter First Minutes: 59 Enter Second Hour: 12 Enter Second Minutes: 0 You cannot take your lunch Solution: hr1=input('Enter First Hour: ') min1=input('Enter First Minutes: ') hr2=input('Enter Second Hour: ') min2=input('Enter Second Minutes: ') time1=hr1*60+min1 time2=hr2*60+min2 print('\\n') if time1 > time2: print('Invalide input') elif time2-time1 >=45: print (\"you can take your lunch\") else: National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus Page 11 of 11 print (\"you cannot take your lunch\")",
    "chunk_type": "generic",
    "word_count": 188,
    "char_count": 1155,
    "source_document": "PF Mid-1 Fall-2015 (Solution-Q2-Q3-Q4-Q5).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 1 of 8 _____________________________________________ _____________________ Student NameRoll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space write on the back side of the paper and clearly mark question and part number etc. 4. After asked to commence the exam, please verify that you have eight (8) different printed pages including this title page. There are total of 5 questions. 5. Use of calculator is strictly prohibited. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. Q-1 Q-2 Q-3 Q-4 Q-5 Total Marks Obtained Total Marks 20 20 20 20 20 100 Vetted By: _____________________________Vetter Signature: _____________________ Serial No: Sessional I Total Time: 1 Hour Total Marks: 100 ________________ Signature of Invigilator CS101 Introduction to Computing Saturday, November 2, 2013 Course Instructor Dr. Shahzad Rajput and Dr. Sibt ul Hussain National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 2 of 8 20 2.5 2.5 2.5 2.5 Q. No. 1 (a) What is the binary representation of 205010? (b) What is the hexadecimal representation of 4278? (c) Given that 12010= 0111 10002, what is the signed binary representation of -12510? (d) Given that 358410 = 7*29, what is the binary representation of 359910? National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 3 of 8 5 5 (e) What is the 16-bit approximation of -11101.11011101101112 in normalized binary form using the following convention? Sign of mantissa = left most bit ( where 0: +; 1: - ) Mantissa = next 11 bits, leading 1 is hidden, really represents 12 bits Exponent = next four bits, bias 7 (f) Interpret the normalized binary number 1101 1010 0000 11012 using the convention mentioned below: Sign of mantissa = left most bit ( where 0: +; 1: - ) Mantissa = next 11 bits, leading 1 is hidden, really represents 12 bits Exponent = next four bits, bias 7 Find its decimal equivalent. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 4 of 8 20 5 5 Q. No. 2 (a) What is the output of the following C++ code? (b) What is the output of the following C++ code? int j = 31234; for( int i=1; i<=5; i++ ){ if( i%2 ) if( i%4 ) j += 4; else j+=10; } cout << j << endl; Output: char options[] = { 'a', 'b', 'c', 'A', 'B', 'C' }; for( int i = 0; i",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2946,
    "source_document": "PF Mid-2 Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "of the following C++ code? int j = 31234; for( int i=1; i<=5; i++ ){ if( i%2 ) if( i%4 ) j += 4; else j+=10; } cout << j << endl; Output: char options[] = { 'a', 'b', 'c', 'A', 'B', 'C' }; for( int i = 0; i <= 5; i++ ){ switch( options[ i ] ){ case 'a': case 'A': cout << \"C\"; break; case 'b': case 'B': cout << \"S\"; case 'c': cout << \"B\"; break; default: cout << \"A\"; } } Output: National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 5 of 8 20 10 (c) What is the output of the following C++ code? int i = 1; do{ for(int j=i; j<=3; j++){ int k = j; while( k <= 3 ){ if( ( i<=3 && i>=2 ) || j<3 ) cout << \"A\" << i; else cout << \"B\" << i; k++; } cout << endl; } cout << \"K\" << endl; i++; }while( i <= 3 ); Output: National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 6 of 8 10 10 Q. No. 3 a) Write a nested while loop that displays the following output on screen: 5 4 3 2 1 3 2 1 1 b) Write a nested for loop that displays the following output on screen: 5 6 5 7 5 8 6 7 6 8 7 8 8 8 National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 7 of 8 20 Q. No. 4 Write a complete C++ program that lets the user enter two 3x3 matrices containing integer values, store these matrices in two two-dimensional arrays. The program should then display the sum of these matrices [Recall from your Linear Algebra course that sum of two matrices is computed by taking sum of their corresponding individual elements]. National University of Computer and Emerging Sciences School of Computing Fall 2013 Islamabad Campus Page 8 of 8 20 Q. No. 5 Write a program that finds the square root of a number X using bisection method (or binary search method). Bisection method is a very simple and popular method. It is used in many real world situations to find a number with a certain property. The algorithm for bisection method work as follows. First of all you assume a broad search interval [low, high] in which your result (in our case square root) falls. Then in each iteration you reduce the size of your search interval until you find the answer. To reduce the size of your search interval you find the mid value of the search interval (i.e. mid= (a+b) / 2 ) and check whether your answer lies in the range [low, mid] or [mid, high]. If the answer lies in the interval [low, mid] you reset your search interval in the next iteration to [low, mid], otherwise to [mid, high]. For example, for X=25, bisection method will generate following iterations. low= 0.0 high= mid= 12.5 ans =",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2617,
    "source_document": "PF Mid-2 Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "in the range [low, mid] or [mid, high]. If the answer lies in the interval [low, mid] you reset your search interval in the next iteration to [low, mid], otherwise to [mid, high]. For example, for X=25, bisection method will generate following iterations. low= 0.0 high= mid= 12.5 ans = 12.5 low= 0.0 high= mid= 6.25 ans = 6.25 low= 0.0 high= mid= 3.125 ans = 3.125 low= 3.125 high= mid= 4.6875 ans = 4.6875 low= 4.6875 high= mid= 5.46875 ans = 5.46875 low= 4.6875 high= mid= 5.078125 ans = 5.078125 low= 4.6875 high= mid= 4.8828125 ans = 4.8828125 low= 4.8828125 high= mid= 4.98046875 ans = 4.98046875 low= 4.98046875 high= mid= 5.029296875 ans = 5.029296875 low= 4.98046875 high= mid= 5.0048828125 ans = 5.0048828125 low= 4.98046875 high= mid= 4.99267578125 ans = 4.99267578125 low= 4.99267578125 high= mid= 4.99877929688 ans = 4.99877929688 low= 4.99877929688 high= mid= 5.00183105469 ans = 5.00183105469 5.00030517578 is close to square root of 25",
    "chunk_type": "generic",
    "word_count": 155,
    "char_count": 951,
    "source_document": "PF Mid-2 Fall-2013.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 1 of 8 ____________ ______________ ___________________ _____________________ Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. Please read the complete paper before attempting any question and manage your time intelligently. 3. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 4. If you need more space write on the back side of the paper and clearly mark question and part number etc. 5. After asked to commence the exam, please verify that you have eight (8) different printed pages including this title page. There are total of 4 questions. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. Q-1 Q-2 Q-3 Q-4 Total Marks Obtained Total Marks 30 20 15 10 75 Vetted By: _____________________________Vetter Signature: _____________________ Serial No: Sessional II Total Time: 1 Hour Total Marks: 75 ________________ Signature of Invigilator CS101 Introduction to Computing Monday, November 10, 2014 Course Instructor Dr. Sibt ul Hussain, Dr. Hassan Mujtaba, Ms. Uzma Marooof National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 2 of 8 30 5 5 5 Q. No. 8.1: Please read the questions carefully and do look for both syntax as well semantics errors. (a) What is the output of the following C++ code? (b) What is the output of the following python code? (c) What is the output of the following code? int main() { float j = 9; float k=10; float l= j/k *(2/4)+ 30%4; int m=l + 32.0/3.0+6; int c, d=0; d= c + d+1 ; cout << m <<\" \"<<l<<endl; cout << c <<\" \"<<d<<endl; } Output: def funA(str): print ' Hello ' + str, return str print 'Students ' def funB(a): print 'Hello', c=funA(a) return c + ' Students ' print c a='xyz' str='ITC' z=funB(str) print z Output: int main() { int x=-20; while(x) { int j=0; while(++j < 4); cout<<\" Hello \"<<endl; if(j==4); else cout<<\" OK \"; x+=10; } } Output: National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 3 of 8 5 5 5 (d) What is the output of the following code? (e) What is the output of the following code? (f) What is the output of the following code? int i=-5,j=0; for(i; i ;) { j=0; for (j; j < 5; ++j); cout<< \" * \"; cout<<endl; i++; } Output: int i=-5,j=0; for(i; i ;) { j=0; for (j=0; j < 5; ++j) cout<< \" * \"; cout<<endl; i++; } Output: int i=1,j=1,k=1; while (i <= 2) { j=1; while (j <= 3) { k=2; while(k <= 4)",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2895,
    "source_document": "PF Mid-2 Fall-2014.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "j < 5; ++j); cout<< \" * \"; cout<<endl; i++; } Output: int i=-5,j=0; for(i; i ;) { j=0; for (j=0; j < 5; ++j) cout<< \" * \"; cout<<endl; i++; } Output: int i=1,j=1,k=1; while (i <= 2) { j=1; while (j <= 3) { k=2; while(k <= 4) { cout<<(\"*\"); k++; } cout<<(\"!\"); j++; } cout<<endl; i++; } Output: National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 4 of 8 10 20 Q. No. 2 a) Write a Python function named minGap that accepts an integer list as a parameter and returns the minimum 'gap' between adjacent values in the list. The gap between two adjacent values in a list is defined as the second value minus the first value. For example, suppose a variable called train is a list of integers that stores the following sequence of values: train = [1, 3, 6, 7, 12] The first gap is 2 (3 - 1), the second gap is 3 (6 - 3), the third gap is 1 (7 - 6) and the fourth gap is 5 (12 - 7). Thus, the call of minGap(train) should return 1 because that is the smallest gap in the array. If you are passed a list with fewer than 2 elements, you should return -1. National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 5 of 8 10 b) Write a program (C++ or Python) that displays the following output on screen: National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 6 of 8 15 Q. No. 3 Write a C++ program that accepts two integer inputs rows and cols and outputs a comma separated grid of numbers where the first input (rows) represents the number of rows of the grid and the second input (cols) represents the number of columns. The numbers count up from 1 to (rows X cols). Input: Rows=3, Cols=6 Rows=5, Cols=3 Rows=4, Cols=1 Rows=1, Cols=3 National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 7 of 8 10 Q. No. 4 Suppose you are given two strings (they may be empty), s1 and s2. You would like to \"lace\" these strings together, by successively alternating elements of each string (starting with the first character of s1). If one string is longer than the other, then the remaining elements of the longer string should simply be added at the end of the new string. For example, if we lace 'abcd' and 'efghi', we would get the new string: 'aebfcgdhi' def laceStrings(s1, s2): \"\"\" s1 and s2 are strings. Returns a new str with elements of s1 and s2 interlaced, beginning with s1. If strings are not of same length, then the extra elements should appear at the end. Draw a Smiley on the top of front page to gain two bonus marks \"\"\" # Your Code Here National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 8 of 8",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2750,
    "source_document": "PF Mid-2 Fall-2014.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "not of same length, then the extra elements should appear at the end. Draw a Smiley on the top of front page to gain two bonus marks \"\"\" # Your Code Here National University of Computer and Emerging Sciences School of Computing Fall 2014 Islamabad Campus Page 8 of 8",
    "chunk_type": "generic",
    "word_count": 50,
    "char_count": 266,
    "source_document": "PF Mid-2 Fall-2014.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2015 Islamabad Campus CS101 Introduction to Computing Monday, October 19, 2015 Course Instructor(s) Dr. Sibt ul Hussain, Dr. Abdul Malik and Ms. Uzma Maroof Serial No: Mid-II Total Time: 1 Hour Total Marks: 55 Signature of Invigilator Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. If you need more space write on the provided rough pages (at the back end of the paper) and clearly mark question and part number etc. 3. After asked to commence the exam, please verify that you have (10) different printed pages including this title page. There are total of (4) questions. 4. Use of calculator is strictly prohibited. 5. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 6. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. 7. Please allocate your time properly according to the marks distribution. 8. Write proper explanation of the error (or bug) where required, without proper explanation no marks will be awarded. I II III IV Total Total Marks 25 10 10 10 55 Marks Obtained Vetted By: Vetter Signature: CS101 - Introduction to Computing Fall 2015 Mid-II Question I. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .(25 Marks) Please write proper explanation of the bug where required, without proper explanation no marks will be awarded. (1) (5 Marks) What would be the output produced by executing the following Python code? Identify and correct errors, and write output, if any. 1 def carbonated( coke, soda, pop): 2 print(\"say \" + soda + \" not \" + pop + \" or \" + coke) 3 4 5 def main(): 6 soda = \"coke\"; 7 pop = \"pepsi\"; 8 coke = \"pop\"; 9 pepsi = \"soda\"; 10 say = pop; 11 12 carbonated(soda, pop, pepsi); 13 carbonated(coke, soda, pop); 14 carbonated(pop, pepsi, pepsi); 15 carbonated(\"pop\", pop, \"koolaid\"); 16 carbonated(say, \"say\", pop); 17 carbonated(say, \"say\", say); 18 19 main() Output (2) (5 Marks) What would be the output produced by executing the following Python code? 1 def fun(x,y): 2 x=x+1 3 y=y-1 4 return x+y 5 x=4 6 y=5 7 x=fun(x,y) 8 print(x+y) 9 y=fun(y,x) 10 print(x+y) Page 2 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Output (3)",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2663,
    "source_document": "PF Mid-2 Fall-2015.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "Marks) What would be the output produced by executing the following Python code? 1 def fun(x,y): 2 x=x+1 3 y=y-1 4 return x+y 5 x=4 6 y=5 7 x=fun(x,y) 8 print(x+y) 9 y=fun(y,x) 10 print(x+y) Page 2 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Output (3) (5 Marks) What would be the output produced by executing the following Python code? 1 x=1 2 y=1 3 z=1 4 while x <= 2: 5 y=1; 6 string=x*\"-\"+\"|\" 7 8 while y <= 3 : 9 z=2; 10 11 while z <= 4 : 12 13 string+=\"#\"; 14 z+=1; 15 16 string+=\"|\"; 17 y+=1; 18 19 string+=x*\"-\" 20 print(string); 21 x+=1; Output (4) (5 Marks) What would be the output produced by executing the following Python code? 1 def listMystery(list): 2 i=2 3 while i < len(list): 4 list[i] = list[i] + list[i - 1] + list[i - 2]; 5 i=i+1 6 7 return list 8 9 print ( listMystery( [8] ) ) 10 print ( listMystery( [3, 0, 1, 4, 7] ) ) 11 print ( listMystery( [7, 4, -10, 8, 2] ) ) Page 3 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Output (5) (5 Marks) What would be the output produced by executing the following Python code? 1 def trick(l,i): 2 if i==1: 3 return l[0]; 4 else : 5 return l[1] 6 7 def foo(x): 8 x[0] = 'def' 9 x[1] = 'abc' 10 return x[1] 11 12 13 q = ['abc', 'def'] 14 print(trick(q,1) == foo(q)) 15 print(trick(q,1) == foo(q)) 16 print(trick(q,0) == foo(q)) Output Page 4 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Question II . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (10 Marks) (1) (5 Marks) Write a function isAllEven that takes an list of integers as a parameter and that returns a boolean value indicating whether or not all of the values are even numbers (True for yes, False for no). For example, if a variable called list stores the following values, i.e.: list=[18, 0, 4, 204, 8, 4, 2, 18, 206, 1492, 42] Then the call isAllEven(list) should return True because each of these integers is an even number. If instead the list had stored these values: list=[2, 4, 6, 8, 10, 208, 16, 7, 92, 14] Then the call should return False because, although most of these values are even, the value 7 is an odd number. Write your solution to isAllEven(list) below. Page 5 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II (2) (5 Marks) Write a C++ program to display following",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2420,
    "source_document": "PF Mid-2 Fall-2015.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "Then the call should return False because, although most of these values are even, the value 7 is an odd number. Write your solution to isAllEven(list) below. Page 5 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II (2) (5 Marks) Write a C++ program to display following pattern (6 rows and 10 columns) using cout state- ments (without using loops). +--------+ |\\ /| | \\ / | | \\ / | | \\/ | +--------+ Page 6 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Question III . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (10 Marks) Write a Python program that displays the following pattern (there are 8 rows and 11 columns) on screen using loops. +---------+ * * * * * * * * * * * +---------+ Page 7 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Question IV . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (10 Marks) Write a function named evenOdd that accepts a list of integers as a parameter and rearranges the list elements so that all of its odd elements are in positions with odd-numbered indexes and all of its even elements are in positions with even-numbered indexes. The list passed in will always contain exactly as many even values as odd values. The exact order of the elements in the list after your function is run on it is unimportant as long as its content alternates between even and odd values, starting with even ([even value, odd value, even value, odd value...]). For example, if your function were passed the following list: 1 a1 = [5, 6, 3, 3, 2, 5, 2, 6] 2 evenOdd(a1) One acceptable ordering of the elements after the call would be: a1=[6, 5, 6, 3, 2, 5, 2, 3] The even-numbered indexes of this list are 0, 2, 4, 6 and each of these positions contains an even integer. The odd-numbered indexes of this list are 1, 3, 5, 7 and each of these positions contains an odd integer. 1 def evenOdd(list): 2 \"\"\" 3 Arrange the elements in the list so that even and 4 odd numbers should",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2196,
    "source_document": "PF Mid-2 Fall-2015.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "6 and each of these positions contains an even integer. The odd-numbered indexes of this list are 1, 3, 5, 7 and each of these positions contains an odd integer. 1 def evenOdd(list): 2 \"\"\" 3 Arrange the elements in the list so that even and 4 odd numbers should be at even and odd indeces respectively. 5 6 \"\"\" 7 # Your Code Here Page 8 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Rough Work Page 9 of 10 Continue... CS101 - Introduction to Computing Fall 2015 Mid-II Rough Work Page 10 of 10 End",
    "chunk_type": "generic",
    "word_count": 100,
    "char_count": 521,
    "source_document": "PF Mid-2 Fall-2015.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Spring 2017 Islamabad Campus CS103 Computer Programming Tuesday, March 28, 2017 Course Instructor(s) Sibt ul Hussain, Aneequa Sundus and Atifa Sarwar Serial No: Mid-II Total Time: 1 Hour Total Marks: 75 Signature of Invigilator Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space write on the back side of the paper and clearly mark question and part number etc. 4. After asked to commence the exam, please verify that you have (13) different printed pages including this title page. There are total of (3) questions. 5. Use of calculator is strictly prohibited. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. 8. Please allocate your time properly according to the marks distribution. 9. Write proper explanation of the error (or bug) where required, without proper explanation no marks will be awarded. I II III Total Total Marks 35 20 20 75 Marks Obtained Vetted By: Vetter Signature: CS103 - Computer Programming Spring 2017 Mid-II Question I. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .(35 Marks) Please write proper explanation of the bug or error where required, without proper explanation no marks will be awarded. (1) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, and write output, if any. 1 #include <iostream> 2 using namespace std; 3 class Number { 4 private: 5 int *n; 6 public: 7 Number() : n(new int) { 8 *n=5; 9 } 10 Number( int nn ) 11 :n(new int) 12 { 13 *n=nn; 14 cout << *n<<\" \"; 15 } 16 Number(Number const& otherNum) 17 : n(otherNum.n) 18 { 19 cout << *n<<\" \"; 20 *n+=4; 21 } 22 23 void display() { cout << *n<<\" \"; } 24 void increase() { *n += 1; } 25 }; 26 int main(){ 27 Number a, b(1), c(b); 28 b.increase(); 29 c.display(); 30 b.display(); 31 } (2) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2607,
    "source_document": "PF Mid-2 Spring-2017.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "{ *n += 1; } 25 }; 26 int main(){ 27 Number a, b(1), c(b); 28 b.increase(); 29 c.display(); 30 b.display(); 31 } (2) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 class A { 4 int len; 5 int *ptr; 6 public: Page 2 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II 7 A() { 8 len = 0; 9 ptr = NULL; 10 } 11 A(int l, int *arr) { 12 initialize(l); 13 for (int i = 0; i < l; i++) 14 ptr[i] = arr[i]; 15 } 16 void initialize(int l) { 17 ptr = new int[l]; 18 for (int i = 0; i < l; i++) 19 ptr[i] = 0; 20 } 21 void operator=(const A &a) { 22 len = a.len; 23 for (int i = 0; i < len; i++) 24 ptr[i] = a.ptr[i]; 25 } 26 A operator+(const A a) { 27 A temp; 28 temp.initialize(len); 29 for (int i = 0; i < len; i++) 30 temp.ptr[i] = ptr[i] + a.ptr[i]; 31 return temp; 32 } 33 int& operator()(int i) const { 34 if (i < len) 35 return ptr[i]; 36 } 37 int GetLen() const { 38 return len; 39 } 40 41 ˜A() { 42 if (ptr != NULL) 43 delete[] ptr; 44 } 45 }; 46 47 void operator <<(ostream &o, const A &a) { 48 for (int i = 0; i < a.GetLen(); i++) 49 o << a(i) << \" \"; 50 cout << endl; 51 } 52 53 int main() { 54 int arr1[] = { 1, 2, 3, 4, 5 }; 55 int arr2[] = { 5, 4, 3, 2, 1 }; 56 A v1(5, arr1), v2(5, arr2), v3; 57 cout << v1; 58 cout << (v1 + v2); 59 v3 = v2; Page 3 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II 60 cout << v3; 61 } (3) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 class Mystery { 4 int * p; 5 public: 6 Mystery(int value = 0) { 7 p = new int; 8 *p = value; 9 } 10 int getP() { 11 return *p; 12 } 13 bool setP(int x) { 14 *p = x; 15 } 16 Mystery & operator=(const Mystery& t) { 17 p = new int; 18 *p = *t.p; 19 } 20 Mystery add(const Mystery &toAdd) { 21 Mystery Res = toAdd; 22 *Res.p += *p + *toAdd.p; 23 return Res; 24 } 25 ˜Mystery() { 26 delete p; 27 } 28 }; 29 int main() { 30 Mystery obj_one(3); 31 Mystery obj_two(6); 32 obj_one.add(obj_two); 33 cout << obj_two.getP(); 34 return 0; 35 } Page 4 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II (4) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors,",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2356,
    "source_document": "PF Mid-2 Spring-2017.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "main() { 30 Mystery obj_one(3); 31 Mystery obj_two(6); 32 obj_one.add(obj_two); 33 cout << obj_two.getP(); 34 return 0; 35 } Page 4 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II (4) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 class ShoppingCart { 4 private: 5 static int itemsCount; 6 string itemName; 7 public: 8 ShoppingCart() : 9 itemName(\"\") { 10 } 11 ShoppingCart(string n) : 12 itemName(n) { 13 } 14 void setItemsCount(int count) { 15 this->itemsCount = count; 16 } 17 static int getItemsCount() { 18 return itemsCount; 19 } 20 }; 21 int main() { 22 ShoppingCart Sc_one; 23 ShoppingCart Sc_two(\"1\"); 24 Sc_one.setItemsCount(5); 25 Sc_two.setItemsCount(10); 26 cout << ShoppingCart::getItemsCount(); 27 return 0; 28 } Page 5 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II (5) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 4 class Point { 5 int x, y; 6 public: 7 Point(int a = 0, int b = 0) { 8 x = a; 9 y = b; 10 print(); 11 } 12 void print() { 13 cout << \" (\" << x << \",\" << y << \") \" << endl; 14 } 15 ˜Point() { 16 cout << \"Point is going\" << endl; 17 } 18 }; 19 class Circle { 20 Point center; 21 float radius; 22 public: 23 Circle() : 24 center(0, 0) { 25 radius = 0; 26 cout << \"The basic circle\" << endl; 27 } 28 Circle(Point p) : 29 center(p) { 30 } 31 Circle(const Circle & c) : 32 center(c.center), radius(c.radius) { 33 cout << \"The copied circle\"; 34 center.print(); 35 } 36 ˜Circle() { 37 cout << \"Circle is going\" << endl; 38 } 39 }; 40 int main() { 41 Point p1; 42 Circle c1(p1); Page 6 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II 43 Circle c3(c1), c4(Circle(c1)); 44 return 0; 45 } (6) (10 Marks) Identify and correct the errors in the following code so that the main() function could run (You can add new functions if needed). You cannot change the main() function! 1 #include<iostream> 2 using namespace std; 3 class Student{ 4 string name; 5 string rollno; 6 public: 7 Student(string n, string r){ name=n;rollno=r;} 8 }; 9 class Class { 10 const int nstudents; 11 Student s[10]; 12 public: 13 Class() { 14 nstudents=10; 15 } 16 Class(const Class c) 17 { 18 *this=c; 19 } 20 void operator<<(const ostream & out) 21 { 22 for(int i=0; i < nstudents;++i) 23 out<< s[i]; 24 } 25 Student operator[](int & i) 26 { 27 if(i >=0 && i < nstudents) 28 return s[i]; 29 } 30 }; 31 Class operator=(const Class & c1, const Class & c2) 32 { 33 for(int i=0; i < nstudents;++i) 34 c1[i]=c2[i]; 35 } 36 int main() { 37 Class c, c2; 38 c2=c;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2742,
    "source_document": "PF Mid-2 Spring-2017.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "& i) 26 { 27 if(i >=0 && i < nstudents) 28 return s[i]; 29 } 30 }; 31 Class operator=(const Class & c1, const Class & c2) 32 { 33 for(int i=0; i < nstudents;++i) 34 c1[i]=c2[i]; 35 } 36 int main() { 37 Class c, c2; 38 c2=c; 39 c2<<cout; 40 c<<cout; Page 7 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II 41 return 0; 42 } Page 8 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II Question II . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (20 Marks) Your goal is to write a program for creating a MovieStore.Your MovieStoreshould allow for storage of many movies, where each movies should be represented by its name and a unique ID and ratings it has received from users (assume there will be only ten ratings per movie). Your MovieStoreshould also store each user information, where each user can have a name, and unique ID, and the ratings he has given to all movies (assumer ten ratings from a user). In addition, to basic functionality (you have to identify the basic data members and member functions) your MovieStore should allow facility of performing following operations: 1 int main(){ 2 MovieStore s1, s2; // create two stores 3 s1.AddMovie(\"Hobbit\", 4.5); // add a movie with average rating of 4.5 4 s1.AddUser(\"Alpha\", 3.7); // add a user with average rating of 3.7 5 s1.AddMovieRatings(\"Hobbit\", \"Alpha\") = 5; // Add the user \"Alpha's\" rating for movie hobbit this should add the user ratings to movie \"Hobbit\" as well as to users record as well ,→ ,→ 6 s1.AddMovieRatings(2, 3) = 1; // add the rating of 1 for movie id 2 form user-id 3; ,→ 7 cout << s1[\"Hobbit\"]; // should print the movie hobbit ratings 8 cout << s1; // should display all the Movie store information 9 } Page 9 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II C Page 10 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II Question III . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (20 Marks) Your goal here is to create a system for managing menus at a",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2240,
    "source_document": "PF Mid-2 Spring-2017.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (20 Marks) Your goal here is to create a system for managing menus at a restaurant. A user can build a menu from choosing any of following four choices: Starter, Main Dish, Drinks, Desserts. Each choice can contain an item with its name, number of servings, its price and whether price is charged per serving or not (a boolean). Your goal is to identify and write the classes, their data members and functions. Your code must be able to be executed against following sample code. 1 int main(){ 2 Menu m1,m2; 3 m1 += \"Starter\"; 4 m1 += \"MDish\"; //main dish 5 m1 += \"Drinks\"; 6 m1 += \"Desserts\" 7 m1[\"Starter\"] += Item(\"RussianSalad\", 2, 300, true); 8 m1[\"Starter\"] += Item(\"Raita\", 1, 100, true); 9 m1[\"MDish\"] += Item(\"Karahi\", 7, 1200, false); 10 m1[\"Drinks\"] += Item(\"7up\", 6, 100, true); 11 m1 -= \"Desserts\"; 12 cout<< m1; // should print the complete menu with each price item and total price. ,→ 13 m2+=\"Drinks\"; 14 m2[\"Drinks\"] += Item(\"CocaCola\", 3, 100, true); 15 cout<< m2; 16 } (1) (5 Marks) Identify all the operators you need to overload, and write down their signatures. Page 11 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II (2) (15 Marks) Now write all complete code with the required data members, member functions and operators Page 12 of 13 Continue... CS103 - Computer Programming Spring 2017 Mid-II Page 13 of 13 End",
    "chunk_type": "generic",
    "word_count": 269,
    "char_count": 1425,
    "source_document": "PF Mid-2 Spring-2017.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Spring 2018 Islamabad Campus CS103 Computer Programming Tuesday, April 3, 2018 Course Instructor(s) Sibt ul Hussain, Hassan Mustafa and Raﬁa Rahim Serial No: Mid-II Total Time: 1 Hour Total Marks: 75 Signature of Invigilator Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space write on the back side of the paper and clearly mark question and part number etc. 4. After asked to commence the exam, please verify that you have (13) different printed pages including this title page. There are total of (3) questions. 5. Use of calculator is strictly prohibited. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. 8. Please allocate your time properly according to the marks distribution. 9. Write proper explanation of the error (or bug) where required, without proper explanation no marks will be awarded. I II III Total Total Marks 35 20 20 75 Marks Obtained Vetted By: Vetter Signature: CS103 - Computer Programming Spring 2018 Mid-II Question I. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .(35 Marks) Please write proper explanation of the bug or error where required, without proper explanation no marks will be awarded. (1) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include <iostream> 2 using namespace std; 3 class Mystery { 4 private: 5 int *n; 6 public: 7 Mystery() : n(new int) { 8 *n=5; 9 } 10 Mystery( int nn ) 11 :n(new int) 12 { 13 *n=nn; 14 } 15 void operator=(const Mystery & n) 16 { 17 this->n= new int; 18 *this->n=*n.n; 19 } 20 void display() { cout << *n<<\" \"; } 21 void increase() { *n += 1; } 22 }; 23 int main(){ 24 Mystery b(1), c=b; 25 b.increase(); 26 27 Mystery a(c); 28 29 a.increase(); 30 a.display(); 31 b.display(); 32 c.display(); 33 } (2) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 class A",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2622,
    "source_document": "PF Mid-2 Spring-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "Mystery b(1), c=b; 25 b.increase(); 26 27 Mystery a(c); 28 29 a.increase(); 30 a.display(); 31 b.display(); 32 c.display(); 33 } (2) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 class A { 4 int len; Page 2 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II 5 int *ptr; 6 public: 7 A() { 8 len = 0; 9 ptr = NULL; 10 } 11 A(int l, int *arr) { 12 initialize(l); 13 for (int i = 0; i < l; i++) 14 ptr[i] = arr[i]; 15 } 16 void initialize(int l) { 17 ptr = new int[l]; 18 for (int i = 0; i < l; i++) 19 ptr[i] = 0; 20 } 21 void operator=(const A &a) { 22 len = a.len; 23 for (int i = 0; i < len; i++) 24 ptr[i] = a.ptr[i]; 25 } 26 A operator+(const A a) { 27 A temp; 28 temp.initialize(len); 29 for (int i = 0; i < len; i++) 30 temp.ptr[i] = ptr[i] + a.ptr[i]; 31 return temp; 32 } 33 int& operator()(int i) const { 34 if (i < len) 35 return ptr[i]; 36 } 37 int GetLen() const { 38 return len; 39 } 40 41 ˜A() { 42 if (ptr != NULL) 43 delete[] ptr; 44 } 45 }; 46 47 void operator <<(ostream &o, const A &a) { 48 for (int i = 0; i < a.GetLen(); i++) 49 o << a(i) << \" \"; 50 cout << endl; 51 } 52 53 int main() { 54 int arr1[] = { 1, 2, 3, 4, 5 }; 55 int arr2[] = { 5, 4, 3, 2, 1 }; 56 A v1(5, arr1), v2(5, arr2), v3; 57 cout << v1; Page 3 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II 58 cout << (v1 + v2); 59 v3 = v2; 60 cout << v3; 61 } (3) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 class Mystery { 4 int * p; 5 public: 6 Mystery(int value = 0) { 7 p = new int; 8 *p = value; 9 } 10 int getP() { 11 return *p; 12 } 13 bool setP(int x) { 14 *p = x; 15 } 16 Mystery & operator=(Mystery t) { 17 p = new int; 18 *p = *t.p; 19 return *this; 20 } 21 Mystery add(const Mystery &toAdd) { 22 Mystery Res; 23 Res=toAdd; 24 *Res.p += *p + *toAdd.p; 25 return Res; 26 } 27 ˜Mystery() { 28 delete p; 29 } 30 }; 31 int main() { 32 Mystery o1(3); 33 Mystery o2(6); 34 Mystery o3; Page 4 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II 35 o3=o1.add(o2); 36 cout <<o2.getP(); 37 cout <<\" \" <<o3.getP(); 38 return 0; 39 } (4) (5 Marks) What would be the output produced by executing the following",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2368,
    "source_document": "PF Mid-2 Spring-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "{ 32 Mystery o1(3); 33 Mystery o2(6); 34 Mystery o3; Page 4 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II 35 o3=o1.add(o2); 36 cout <<o2.getP(); 37 cout <<\" \" <<o3.getP(); 38 return 0; 39 } (4) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 class ShoppingCart { 4 private: 5 static int itemsCount; 6 string itemName; 7 public: 8 ShoppingCart(string n=\"1\") : 9 itemName(n) { 10 cout << \" Item= \" << itemName << \" \"<<++itemsCount<<endl; 11 } 12 void setItemsCount(int count) { 13 this->itemsCount = count; 14 } 15 static int getItemsCount() { 16 return itemsCount; 17 } 18 ˜ShoppingCart() 19 { 20 itemsCount--; 21 } 22 }; 23 int ShoppingCart::itemsCount=0; 24 int main() { 25 ShoppingCart Sc_one; 26 ShoppingCart Sc_two(\"2\"); 27 Sc_one.setItemsCount(5); 28 { 29 ShoppingCart sc_Three(\"3\"); 30 ShoppingCart *scfour; 31 scfour=&sc_Three; Page 5 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II 32 } 33 Sc_two.setItemsCount(10); 34 cout << ShoppingCart::getItemsCount(); 35 return 0; 36 } (5) (5 Marks) What would be the output produced by executing the following C++ code? Identify and correct errors, if any. 1 #include<iostream> 2 using namespace std; 3 4 class Point { 5 int x, y; 6 public: 7 Point(int a = 0, int b = 0) { 8 x = a; 9 y = b; 10 print(); 11 } 12 void print() { 13 cout << \" (\" << x << \",\" << y << \") \" << endl; 14 } 15 ˜Point() { 16 cout << \"Point is going\" << endl; 17 } 18 }; 19 class Circle { 20 Point center; 21 float radius; 22 public: 23 Circle() : 24 center(0, 0) { 25 radius = 0; 26 cout << \"The basic circle\" << endl; 27 } 28 Circle(Point p) : 29 center(p) { 30 } 31 Circle(const Circle & c) : 32 center(c.center), radius(c.radius) { 33 cout << \"The copied circle\"; 34 center.print(); 35 } 36 ˜Circle() { 37 cout << \"Circle is going\" << endl; 38 } Page 6 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II 39 }; 40 int main() { 41 Point p1; 42 Circle c1(p1); 43 Circle c3(c1), c4(Circle(c1)); 44 return 0; 45 } (6) (10 Marks) Identify and correct the errors in the following code so that the main() function could run (You can add new functions if needed). You cannot change the main() function! 1 #include<iostream> 2 #include<string> 3 using namespace std; 4 class Contact{ 5 string name; 6 string phoneno; 7 Contact(string n, string r){ name=n;phoneno=r;} 8 }; 9 class PhoneBook { 10 const int ncontacts; 11 Contact *s; 12 int counter; 13 PhoneBook(int nc) { 14 ncontacts=nc; 15 counter=0; 16 s=new Contact[nc]; 17 } 18 public: 19 PhoneBook(const PhoneBook c) const 20 { 21 *this=c; 22 } 23 Contact GetAt(int & i) const 24 { 25 if(i >=0 && i < ncontacts) 26 return s[i]; 27 } 28 void operator+(Contact & C)const 29 { 30 s[counter++]=C; 31",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2833,
    "source_document": "PF Mid-2 Spring-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "15 counter=0; 16 s=new Contact[nc]; 17 } 18 public: 19 PhoneBook(const PhoneBook c) const 20 { 21 *this=c; 22 } 23 Contact GetAt(int & i) const 24 { 25 if(i >=0 && i < ncontacts) 26 return s[i]; 27 } 28 void operator+(Contact & C)const 29 { 30 s[counter++]=C; 31 } 32 }; 33 PhoneBook operator+=(const PhoneBook & c1, const Contact &C) const 34 { 35 c1+C; 36 } Page 7 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II 37 int main() { 38 PhoneBook c, c2; 39 c+=Contact(\"ABC\",\"123\"); 40 c+=Contact(\"XYZ\",\"456\"); 41 c2=c; 42 c2+=Contact(\"LMK\",\"999\"); 43 PhoneBook c3(c2); 44 return 0; 45 } Page 8 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II Question II . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (20 Marks) Part I W hat would be the output produced by executing the following C++ code? Identify and correct errors, if any. Your goal is to write a program for creating a MovieStore.Your MovieStoreshould allow for storage of many movies, where each movies should be represented by its name and a unique ID and ratings it has received from users (assume there will be only ten ratings per movie). Your MovieStoreshould also store each user information, where each user can have a name, and unique ID, and the ratings he has given to all movies (assumer ten ratings from a user). In addition, to basic functionality (you have to identify the basic data members and member functions) your MovieStore should allow facility of performing following operations: 1 int main(){ 2 MovieStore s1, s2; // create two stores 3 s1.AddMovie(\"Hobbit\", 4.5); // add a movie with average rating of 4.5 4 s1.AddUser(\"Alpha\", 3.7); // add a user with average rating of 3.7 5 s1.AddMovieRatings(\"Hobbit\", \"Alpha\") = 5; // Add the user \"Alpha's\" rating for movie hobbit this should add the user ratings to movie \"Hobbit\" as well as to users record as well ,→ ,→ 6 s1.AddMovieRatings(2, 3) = 1; // add the rating of 1 for movie id 2 form user-id 3; ,→ 7 cout << s1[\"Hobbit\"]; // should print the movie hobbit ratings 8 cout << s1; // should display all the Movie store information 9 } Page 9 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II C Page 10 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II Question III . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2466,
    "source_document": "PF Mid-2 Spring-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "Computer Programming Spring 2018 Mid-II Question III . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (20 Marks) Your goal here is to create a system for building a BinaryStore calculator. A BinaryStore calculator will store bytes “stored in strings” with their addresses, i.e. at each address in the BinaryStore there is stored a Byte. Each address will be 4 characters string and each byte will be 8 characters strings. Your goal is to identify and write the classes, their data members and functions. Your code must be able to be executed against following sample code. Please note that you will have to perform operations at bit-level using characters. 1 int main(){ 2 // address will be only 4 bit long for this problem 3 // bytes will be only 8 bit long 4 // create a 10 locations binary store for storing addresses and values 5 BinaryStore b1(10); 6 b1+=\"0011\"; // add a new address to the store 7 b1.Add(\"0011\",Byte(\"00000010\")); // add the byte at newly added address 8 b1+=\"0110\"; 9 b1.Add(\"0110\",Byte(\"00000110\")); 10 b1+=\"1010\"; 11 Byte nb=b1.Get(\"0011\")+b1.Get(\"0110\"); // add two bytes, bit by bit 12 b1.Add(\"1010\",nb); 13 14 Byte nb2=b1.Get(\"1010\")+b1.Get(\"0110\"); 15 bool r=b1.Get(\"0011\")==b1.Get(\"0110\"); 16 cout<< \"Equal = \" << r << endl; 17 b1.Display(); 18 } x Running this code produces following output Equal = 0 0011 00000010 0110 00000110 1010 00001000 (1) (5 Marks) Identify all the operators and functions you need to overload and write. Please write down their signatures. Page 11 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II (2) (15 Marks) Now write all the classes with the required data members, member functions and operators. Please note that you are only required to write Add, operator+= and operator+ functions in the iden- tiﬁed classes. Page 12 of 13 Continue... CS103 - Computer Programming Spring 2018 Mid-II Page 13 of 13 End",
    "chunk_type": "generic",
    "word_count": 382,
    "char_count": 2003,
    "source_document": "PF Mid-2 Spring-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 1 of 12 ____________ ______________ ___________________ _____________________ Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. Please read the complete paper before attempting any question and manage your time intelligently. 3. Additional sheet are provided for rough work at the end. 4. If you need more space write on the back side of the paper and clearly mark question and part number etc. 5. After asked to commence the exam, please verify that you have twelve (12) different printed pages including this title page. There are total of 6 questions. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. Q-1 Q-2 Q-3 Q-4 Q-5 Q-6 Total Marks Obtained Total Marks 20 15 10 10 10 10 75 Vetted By: _________________________Vetter Signature: _____________________ Serial No: Mid Term Total Time: 2 Hour Total Marks: 75 ________________ Signature of Invigilator CS118 Programming Fundamentals Wednesday, October 24, 2018 Course Instructor Jawad Hassan, Amna Irum Atifa Sarwar National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 2 of 12 Question I ...…………………………………………………………………………. (20 Marks) Write the output produced by executing the following code? Please write proper explanation of the bug where required, without proper explanation no marks will be awarded. [2 marks each] Code Output int main( ) { int x = 8, y = 0, z ; while ( x >= 0 && y <=5 ) { if ( x == y ) break ; else cout<<x<<y ; x-- ; y+=2 ; } return 0; } int main(){ const int U = 8, L = 2; int n1, n2, n3 = 12, n4 = 3; n1 = n3 > n4 ? n4 > U ? n3 : L : L; cout << n1 << endl; return 0; } int main(){ char alphabet= ‘A’; for(int i = (‘F’-‘A’+1); i >= 1; --i) { for(int j = 1; j <= i; ++j) { cout << alphabet << \" \"; } ++alphabet; cout << endl; } return 0; } National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 3 of 12 int main (){ int x, y; x = 5; y = ++x * ++x; cout << x << y; x = 5; y = x++ * ++x; cout << x << y; return 0; } int main (){ int z=1; for(int i = 5 ;i >= 1; --i) { z=i ; for(int z = 1; z <= i; ++z) { cout << z << \" \"; } ++z; cout << i << z<< endl; } return 0; } int main(){ int x = 1, y =2,",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2662,
    "source_document": "PF Mid-Exam Fall-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "main (){ int z=1; for(int i = 5 ;i >= 1; --i) { z=i ; for(int z = 1; z <= i; ++z) { cout << z << \" \"; } ++z; cout << i << z<< endl; } return 0; } int main(){ int x = 1, y =2, n=50 ; while (y <=n ) { if ( n%y == 0 ) { n=n/y; x=x+1; } else { y=y+1; } cout<<x<<y; } return 0; } National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 4 of 12 int main() { int x = 6, y = 7, z ; while ( x >= 0) { while (y >=0) { cout<< y-- ; } cout<< x<<”\\n” ; y=x-- ; } return 0; } int main(){ int suite = 5 ; switch ( suite ) ; { case 0+5 ; cout<< \"\\nClub\" ; case 1+5 ; cout<< \"\\nDiamond\" ; } return 0; } int main() { int a = 0, b=36; float f=3.9; b+= (a = 50)*f/3*10-b%5; cout << a << \"$\" << b; return 0; } int main() { float x = -10; while (x) { x *= 10; x += 10; } cout << x << endl; return 0; } National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 5 of 12 Question II ……………………..……………………………………………………. (15 Marks) a) (5 marks) Write a C++ program using if-elseif-else to input basic salary and allowances of an employee and calculate its Gross salary according to following: Basic Salary <= 10000: HA = 20% of Basic Salary Basic Salary <= 20000: HA = 25% of Basic Salary Basic Salary > 20000: HA = 30% of Basic Salary Gross salary is the final salary computed after the additions of HA (House Allowance) into the Basic Salary. National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 6 of 12 b) (2 marks) Write an input validation loop that asks the user to enter a number in the range of 10 through 25. a) (2 marks) Convert following code into if-elseif-else char sport; cin >> sport; switch (sport) { case 'c': cout << \"You like Cricket\"; case 'f': cout << \"You like Football\"; break; case 't': case 'H': cout << \"You like Tennis\"; cout << \"You like Hockey\"; case 'B': cout << \"You like BasketBall\"; break; } National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 7 of 12 b) (2 marks) Write a C++ program that find maximum value and the minimum value attained by f(x) =𝑥2 + 3𝑥+ 2 the interval [-9, 8]. c) (2 marks) Rewrite the following code in for loop? int i = 3; do { cout << \"Hello World\"; i++; cout << i; } while (i < 5 && i >= 2); d) (2 marks) Point out the logical error in the following program and correct it. int main() { for (int i = 1; i <= 5; i++) { for (int j = 1; i <= 10;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2474,
    "source_document": "PF Mid-Exam Fall-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "World\"; i++; cout << i; } while (i < 5 && i >= 2); d) (2 marks) Point out the logical error in the following program and correct it. int main() { for (int i = 1; i <= 5; i++) { for (int j = 1; i <= 10; j++) { cout<<”*”; } cout<<”\\n”; } } National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 8 of 12 Question III …………………………………………………………………………… (10 Marks) Write a C++ program to check whether a triangle is a right angle triangle or not. Note: In any right triangle, sum of square of two sides is always equal to the square of third side. National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 9 of 12 Question IV …………………………………………………………………………… (10 Marks) The value of a function F is defined by following infinite series: F = 1 3 − 𝑥2 9 + 𝑥4 27 − 𝑥6 81 + 𝑥8 243 … … .. Write a C++ code that take input N (number of terms) and x as arguments and calculates the function’s value. In other words, calculate the sum of the series for first N terms. For example if N=5 and x=2 then it should display 0.744856. National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 10 of 12 Question V.…………………………………………………………………………… (10 Marks) Write a program to print pyramid using numbers For lines = 4 For lines = 5 National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 11 of 12 Question VI …………………………………………………………………………… (10 Marks) Write a C++ program that takes input of an amount from user and print the minimum number of notes (Rs. 500, 100, 50, 20, 10, and 5) required for the amount. Input: Input amount: 575 Output: Total number of notes: 500: 1 100: 0 50: 1 20: 1 10: 0 5: 1 2: 0 1: 0 National University of Computer and Emerging Sciences School of Computing Fall 2018 Islamabad Campus Page 12 of 12",
    "chunk_type": "generic",
    "word_count": 349,
    "char_count": 1890,
    "source_document": "PF Mid-Exam Fall-2018.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "Question 1:\n1.1\n1.2\n1.3\n\n1.4",
    "chunk_type": "question",
    "word_count": 6,
    "char_count": 29,
    "source_document": "PF Practice Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "question_id": "Question 1:"
    }
  },
  {
    "text": "Question 2: What will be the outputs of following snippets, identify any errors.\n2.1\nconst short days = 365, hours = 24, mins = 60, secs = 60;\ncout << \"Seconds in a year = \"\n<< hours * mins * secs * double(days) << endl;\n2.2\nconst double g = 16.;\ndouble t;\ncout << \" Enter time in secs: \";\ncin >> t;\ncout << \"The travel distance is \" << 1 / 2 * (g * t * t)\n<< endl;\n2.3\n2.4\n\n2.5\n2.6\n2.7\n2.8\nstring hello=\" hello\";\n\nint i = 1; \nwhile (i < 6) { \nhello[i­1] = hello[i]; \ni++; \n} \nhello[5] = '!'; \ncout<< hello << endl;\nOutput:\n2.9\nconst int SIZE = 8; \nint a[SIZE]; \nfor (int i = 0; i < SIZE/2; i++) \na[2*i] = i + 1; \nfor (int i = SIZE/2; i < SIZE; i++) \ncout << a[i] << ' '; \ncout << endl;\n2.10\nchar ch1 = '*', ch2 = '+', *s = &ch1;\nch2 = *s;\ncout << ch1 << ch2;\n2.11\nint x = 3, y = 9, &r = y, *p;\np = &y;\n*p = 0;\ncout << x << r;\n2.12\ndouble u = 1.1, v = 1.2, *max = &u;\nif (v > u) max = &v;\ncout << *max;\n2.13\nchar *yes = \"yes\";\nif (*yes == 'y') yes = \"no\";\ncout << yes << endl;\n2.14\ndouble z = 2000, &century = z;\ncout << century++;\n2.15\nint a = –7, b = 3, *p = &a;\ncout << *p;\np = &b;\ncout << *p << endl;\n\n2.16\nint i = 5, j = 6, k = 7, n = 3;\ncout << i + j * k ­ k % n << endl;\ncout << i / n << endl;\n2.17\nint found = 0, count = 5;\nif (!found || ­­count == 0)\ncout << \"danger\" << endl;\ncout << \"count = \" << count << endl;\n2.18\nchar ch;\nchar title[] = \"Titanic\";\nch = title[1];\ntitle[3] = ch;\ncout << title << endl;\ncout << ch << endl;\n2.19\nint main() \n{ \n cout  <<  (n = 4)  <<  endl; \n cout  <<  (n == 4)  <<  endl; \n cout  <<  (n > 3)  <<  endl; \n cout  <<  (n < 4)  <<  endl; \n cout  <<  (n = 0)  <<  endl; \n cout  <<  (n == 0)  <<  endl; \n cout  <<  (n > 0)  <<  endl; \n cout  <<  (n && 4)  <<  endl; \n cout  <<  (n || 4)  <<  endl; \n cout  <<  (!n)  <<  endl; \n \n }\n2.20\nmain() \n{ \nint n = 3; \nwhile (n >= 0) \n{ \ncout << n * n << endl; \n­­n; \n} \ncout << n << endl; \nwhile (n < 4) \ncout << ++n << endl; \ncout << n << endl; \nwhile (n >= 0) \ncout << (n /= 2) << endl;\n\nreturn 0; \n} \n2.21\nmain()\n{\nint n = 4, k = 2;\ncout << ++n << endl;\ncout << n << endl;\ncout << n++ << endl;\ncout << n << endl;\ncout << ­n\n << endl;\ncout << n\n << endl;\ncout << ­­n << endl;\ncout << n << endl;\ncout << n­­ << endl;\ncout << n << endl;\ncout << n + k << endl;\ncout <<\n n\n << endl;\ncout <<\n k\n << endl;\ncout << n << k << endl;\ncout <<\n n << endl;\ncout << \"\n \" << n << endl;\ncout << \" n\" << endl;\ncout << \"\\n\" << endl;\ncout << \" n * n = \"; //CAREFUL!\ncout << n * n << endl;\ncout << 'n' << endl;\nreturn 0;\n}",
    "chunk_type": "question",
    "word_count": 612,
    "char_count": 2487,
    "source_document": "PF Practice Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "question_id": "Question 2:"
    }
  },
  {
    "text": "Question 3: \n3.1\n\n3.2\nWrite a function Distance that returns the distance between the \npoints (x1,y1) and (x2,y2). The distance\nformula is\nd = sqrt(( x2 − x1 )2 + ( y 2 − y 1 )2);\nand the function should work for all integer values of \ncoordinates.\n3.3\n\n3.4\n3.5\nWrite following function \nbool HasPunctuation(const string &str)\n// Returns true if str includes a period, a comma,\n//  a semicolon, or a colon; false otherwise.\n3.6\n\n3.7\n\n3.8",
    "chunk_type": "question",
    "word_count": 79,
    "char_count": 437,
    "source_document": "PF Practice Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "question_id": "Question 3:"
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Hobbitesses at Shire For Saving the World CS103 Computer Programming Course Instructor(s) Gandalf, Frodo, Sam, Gollum, Merry and Fairy Serial No: Sample Final Exam Total Time: 3 Hours Total Marks: 96 Signature of Invigilator Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space write on the back side of the paper and clearly mark question and part number etc. 4. After asked to commence the exam, please verify that you have (22) different printed pages including this title page. There are total of (6) questions. 5. Use of calculator is strictly prohibited. 6. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and make sure that your code is legible. Failing to do so can cost you marks. 8. Please read the question thoroughly and use your time properly, an uneven distribution of time can lead to incomplete answers. I II III IV V VI Total Total Marks 36 10 15 10 15 10 96 Marks Obtained Vetted By: Vetter Signature: CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Question I. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .(36 Marks) (a) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 int num1 = 392; 2 int& num2 = num1; 3 num2 = 444; 4 num1 = num1 + num2; 5 int *pointer1 = &num1; 6 cout<< *pointer1<<endl; (b) (1 Mark) True/False: You must declare all private members of a class before the public members. Solution: False (c) (1 Mark) Assume that InventoryItem is the name of a class, and the class has a void member function named setPrice which accepts a double argument. If book is an instance of the InventoryItem class, which of the following statements properly uses the book object to call the setPrice member function? ⃝InventoryItem::setPrice(1.49) √book.setPrice(1.49) ⃝book::setPrice(1.49) ⃝book:setPrice(1.49) (d) (1 Mark) Declare an array of three InventoryItem objects. Solution: 1 InventoryItem arr[3]; (e) (3 Marks) Write C++ statement(s) to dynamically allocate space for a 5-by-6 matrix of integers. Provide necessary declarations. Solution: 1 int **matrix = new int *[5]; 2 for(int i=0; i<5; i++ ) 3 matrix[i] = new int[6];",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2732,
    "source_document": "PF Sample Final Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "Mark) Declare an array of three InventoryItem objects. Solution: 1 InventoryItem arr[3]; (e) (3 Marks) Write C++ statement(s) to dynamically allocate space for a 5-by-6 matrix of integers. Provide necessary declarations. Solution: 1 int **matrix = new int *[5]; 2 for(int i=0; i<5; i++ ) 3 matrix[i] = new int[6]; (f) (2 Marks) Write C++ statement(s) to free the dynamic memory allocated in the previous part. Solution: Page 2 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam 1 for(int i=0; i<5; i++ ) 2 delete[] matrix[i]; 3 delete[] matrix; (g) (10 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 #include<iostream> 2 #include<vector> 3 using namespace std; 4 int muffin(vector<int>::iterator i, vector<int>::iterator e, int t) { 5 if (i == e) 6 return 0; 7 return ((*i == t) + muffin(++i, e, t)); 8 } 9 int main() { 10 int arr[] = { 45, 33, 45, 32, 31, 33, 45 }; 11 vector<int> v; 12 for (int i = 0; i < 7; i++) 13 v.push_back(arr[i]); 14 for (unsigned int i = 0; i < v.size(); i++) 15 cout << muffin(v.begin(), v.end(), v[i]) << endl; 16 return 0; 17 } Solution: 1 3 2 2 3 3 4 1 5 1 6 2 7 3 Page 3 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam (h) (3 Marks) Modify the code given below such that the following statement o.setX(10).setY(20) can be executed without logical and syntax error: 1 class Horizon { 2 public: 3 void setX(int _x) { 4 x = _x; 5 } 6 void setY(int _y) { 7 y = _y; 8 } 9 private: 10 int x; 11 int y; 12 }; 13 int main() { 14 Horizon o; 15 o.setX(10).setY(20); 16 } Solution: 1 Horizon & setX(int _x) {/*Alias is necessary*/ 2 x = _x; 3 return *this; 4 } (i) (3 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 #include<iostream> 2 using namespace std; 3 class Maze { 4 private: 5 int i; 6 public: 7 Maze(int i) { 8 this->i = i; 9 cout << \" C\" << i << \" \\n\"; 10 } 11 ˜Maze() { 12 cout << \" D\" << i << \" \\n\"; 13 } 14 }; 15 Maze a(1); 16 int build() { 17 Maze d(4); 18 static Maze e(5); 19 } 20 int main() { 21 Maze b(2); 22 static Maze c(3); 23 build(); 24 Maze f(6); 25 return 0; Page 4 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam 26 } Solution: 1 C1 2 C2 3 C3 4 C4 5 C5 6 D4 7 C6 8 D6 9 D2 10 D5 // D5 and D3 order can be reversed. 11 D3 12 D1 Page 5 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam (j) (5 Marks) What will the following program display on screen. Explain the error or bug if",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2532,
    "source_document": "PF Sample Final Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "C6 8 D6 9 D2 10 D5 // D5 and D3 order can be reversed. 11 D3 12 D1 Page 5 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam (j) (5 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 #include<iostream> 2 using namespace std; 3 class Book { 4 public: 5 void info() { 6 cout << endl << (\"This is a simple book \"); 7 } 8 void info(Book &d) { 9 this->info(); 10 d.info(); 11 } 12 }; 13 14 class FunBook: public Book { 15 public: 16 void info() { 17 cout << endl << (\"This is a FunBook \"); 18 } 19 }; 20 class StoryBook { 21 public: 22 void info() { 23 cout << endl << (\"This is a StoryBook \"); 24 } 25 }; 26 27 class NovelBook: public StoryBook { 28 public: 29 void info() { 30 StoryBook::info(); 31 cout << endl << (\"This is a NovelBook\"); 32 } 33 }; 34 int main() { 35 Book *b = new Book; 36 FunBook *fb = new FunBook; 37 b->info(*fb); 38 StoryBook *sb = new NovelBook; 39 sb->info(); 40 } Page 6 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Solution: 1 This is a simple book 2 This is a simple book 3 This is a StoryBook Page 7 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam (k) (5 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 #include<iostream> 2 using namespace std; 3 class Book { 4 public: 5 virtual void info() { 6 cout << endl << (\"This is a simple book \"); 7 } 8 virtual void info(Book &d) { 9 this->info(); 10 d.info(); 11 } 12 }; 13 14 class FunBook: public Book { 15 public: 16 virtual void info() { 17 cout<<endl<< (\"This is a FunBook \"); 18 } 19 }; 20 class StoryBook { 21 public: 22 virtual void info() { 23 cout<<endl<< (\"This is a StoryBook\"); 24 } 25 }; 26 class NovelBook: public StoryBook { 27 public: 28 virtual void info() { 29 StoryBook::info(); 30 cout<<endl<< (\"This is a NovelBook\"); 31 } 32 }; 33 int main() { 34 Book *b = new Book; 35 FunBook *fb = new FunBook; 36 b->info(*fb); 37 StoryBook *sb = new NovelBook; 38 sb->info(); 39 } Solution: Page 8 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam 1 This is a simple book 2 This is a FunBook 3 This is a StoryBook 4 This is a NovelBook Page 9 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Question II . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2414,
    "source_document": "PF Sample Final Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "II . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (10 Marks) (a) (10 Marks) Write a recursive function pattern that only receives a positive integer (non-zero) as argument and prints a pattern on screen. Look at the following examples to make a sense of what is required. INPUT: 5 OUTPUT: ***** **** *** ** * INPUT: 4 OUTPUT: **** *** ** * Page 10 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Solution: 1 void pattern(int n){ 2 if( n > 0 ){ 3 for( int i=0; i<n; i++ ) 4 cout << \"*\"; 5 cout << endl; 6 pattern(n-1); 7 for( int i=0; i<n; i++ ) 8 cout << \"*\"; 9 cout << endl; 10 } 11 } Page 11 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Question III . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (15 Marks) (a) (7 Marks) Write a program that reads a ﬁle containing integers and uses map to display the distinct (unique) numbers in the ﬁle, named input.txt, with their frequencies. For example, you can consider input.txt contains the following: 23 24 12 4 54 12 3 54 23 The output should be: 3:1 4:1 12:2 23:2 24:1 54:2 Page 12 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam (b) (8 Marks) Write a program that reads a text ﬁle speciﬁed by the user and reports how many times each word occurred in the ﬁle. The output should be formatted in two columns, with the words in the ﬁrst column and the numbers in the second column aligned on their right side in a column. You may assume the input ﬁle contains no punctuation marks. An example output is shown below for the ﬁle “in.txt”. Input: In.txt Gandalf is old Gandalf is a wizard Gandalf is a friend to hobbits blah blah blah blah blah blah blah blah blah blah Output Enter file name: in.txt Gandalf 3 is 3 old 1 a 2 wizard 1 friend 1 to 1 hobbits 1 blah 10 Page 13 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Solution: 1 #include<iostream>",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2144,
    "source_document": "PF Sample Final Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "blah blah blah blah blah blah blah blah blah blah Output Enter file name: in.txt Gandalf 3 is 3 old 1 a 2 wizard 1 friend 1 to 1 hobbits 1 blah 10 Page 13 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Solution: 1 #include<iostream> 2 #include<fstream> 3 #include<map> 4 using namespace std; 5 6 int main(){ 7 8 map<int, int> numcount; 9 ifstream ifile(\"input.txt\"); 10 int num; 11 ifile >> num; 12 while(!ifile.eof()){ 13 numcount[num]++; 14 ifile >> num; 15 } 16 17 for( map<int,int>::iterator i=numcount.begin(); 18 i!=numcount.end(); 19 ++i) 20 cout << (*i).first << \":\" << (*i).second << \" \"; 21 22 return 0; 23 } Page 14 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Question IV . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (10 Marks) (a) (10 Marks) Create a class RationalNumber(fractions) with the following capabilities: 1. Create a constructor that two positive integers as numerator and denominator of a fraction. 2. Overload the addition, subtraction, multiplication and division operators for this class. 3. Overload the relational and equality operators for this class. Page 15 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Page 16 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Question V . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (15 Marks) Package-delivery companies, such as TCS, offer a number of different shipping options, each with speciﬁc costs associated. Your goal is to build a system for managing the package-delivery services. Your TCS company provide two types of options TwoDayPackage and OvernightPackage. Each package has following associated information of its sender and recipient, name, address, city, province and postal code. In addition each package has its associated weight(in grams) and cost per gram, this information is used to calculate the shipping cost of the package. Draw a Simley on front page to get three bonus marks. In TwoDayPackage service there is additional ﬂat fee that the shipping company charges for two-day-delivery service. Thus the total shipping cost of TwoDayPackage should be calculated by adding the ﬂat fee to the weight-based cost discussed above. In OvernightPackage your",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2498,
    "source_document": "PF Sample Final Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "a Simley on front page to get three bonus marks. In TwoDayPackage service there is additional ﬂat fee that the shipping company charges for two-day-delivery service. Thus the total shipping cost of TwoDayPackage should be calculated by adding the ﬂat fee to the weight-based cost discussed above. In OvernightPackage your company charges an additional fee per gram for overnight-delivery service. Thus in order to calculate shipping cost it adds the additional fee per gram to the standard cost per gram before calculating the shipping cost. (a) (3 Marks) Build a hierarchical diagram of your system by identifying the main classes and the relationships among them. Page 17 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam (b) (9 Marks) Write the complete code for all the classes (except main) of your TCS system. (c) (3 Marks) Given the classes of your system, now create a function that displays the address information of sender and receiver and calculates the shipping costs for several different Packages. The function could at most receive an array of pointers and size of the array as argument and should display the information Page 18 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam polymorphically. It must keep track of total cost and should return the total cost of all the packages. Page 19 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Question VI . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (10 Marks) Given the following class and main function, write the code for storing and reading the given objects from a binary ﬁle. [Note that string class c str() function returns a pointer to an array that contains a null-terminated sequence of characters.] 1 #include<iostream> 2 #include<vector> 3 #include<string> 4 using namespace std; 5 class Student { 6 friend istream &operator >>(istream &, Student &); 7 friend ostream &operator <<(ostream &, const Student &); 8 public: 9 Student() { 10 sid = -1; 11 nsubjects = -1; 12 marks = NULL; 13 } 14 Student(string sname, int sid, int nsubjects) { 15 this->sname = sname; 16 this->sid = sid; 17 this->nsubjects = nsubjects; 18 marks = new int[nsubjects]; 19 } 20 ˜Student() { 21 if (marks) 22 delete[] marks; 23 } 24 25 private: 26 string sname; 27 int *marks; 28 int sid; 29 int nsubjects; 30 }; 31 istream &operator >>(istream & in, Student & std) { 32 in >> std.sid; 33 in >> std.nsubjects; 34 in >> std.sname; 35 std.marks = new int[std.nsubjects]; 36 for (int i = 0; i < std.nsubjects; ++i) 37 in >> std.marks[i]; 38 return in;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2693,
    "source_document": "PF Sample Final Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 5
    }
  },
  {
    "text": "sid; 29 int nsubjects; 30 }; 31 istream &operator >>(istream & in, Student & std) { 32 in >> std.sid; 33 in >> std.nsubjects; 34 in >> std.sname; 35 std.marks = new int[std.nsubjects]; 36 for (int i = 0; i < std.nsubjects; ++i) 37 in >> std.marks[i]; 38 return in; 39 } 40 ostream &operator <<(ostream &out, const Student &std) { 41 out << std.sname << \" \" << std.sid << \" \" << std.nsubjects << endl; 42 for (int i = 0; i < std.nsubjects; ++i) 43 out << std.marks[i] << \" \"; 44 return out; 45 } 46 47 int main() { 48 Student *std; Page 20 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam 49 int x; 50 cout << \"Enter number of Students\"; 51 cin >> x; 52 std = new Student[x]; 53 for (int i = 0; i < x; ++i) 54 cin >> std[i]; 55 // Now writes the students information to a binary file... 56 57 // Now read the students information from that binary file 58 // and display 59 } Page 21 of 22 CS103 - Computer Programming Hobbitesses at Shire Sample Final Exam Page 22 of 22",
    "chunk_type": "generic",
    "word_count": 201,
    "char_count": 994,
    "source_document": "PF Sample Final Exam.pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 6
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus _____________________________________________ _____________________ Student Name Roll No. Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the last page for rough work. 3. After asked to commence the exam, please verify that you have ten (10) different printed pages including this title page. There are a total of 4 questions. 4. Calculator is not allowed. 5. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. Q-1 Q-2 Q-3 Q-4 Total Marks Obtained Total Marks 20 9 17 14 60 Serial No: Sessional Exam-I Total Time: 1 Hour Total Marks: 60 ________________ Signature of Invigilator CS-1002: Programming Fundamentals (CS) Monday, 26th September, 2022 Course Instructors Dr. Aleem, Dr. Akhtar, Mr. Sheheryar, Ms. Ifrah National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 2 of 10 Question 1 [5+6+9=20 Marks] a. For each expression at left, indicate its value. Consider there is no syntax error. b. For each expression construct and write a logical expression to represent each of the following conditions. Example: Expression: N is a lower case or capital case alphabet. Logical Expression: (N >= ’A’ && N <= ’Z’ ) || (N >= ’a’ && N <= ’z’) Note: consider N is a variable. Expression Value 3 * 5 / 4 * 3 * 2 % 4 + !5 * static_cast<double>(3) / 12 2 (3 != 10 || 6 <= 10 * -200) 1 OR true 'b' > 'Z' 1 OR true static_cast<char>(11 / 7 * 3 * 2 * 39 % 102 + 55) ‘U’ pow(8, 730 % 9) - pow(2 , 5 / 2) / 2 6 Expression Logical Expression N is any number other than multiple of 3. !(N %3 == 0) OR N%3!=0 N is any lower-case alphabet other than vowels (a, e, i, o and u) (N >= 'a' && N <= 'z' && !(N=='a' || N=='e' || N=='i' || N=='o' || N=='u' )) OR (N >= 'a' && N <= 'z' && (N!='a' && N!='e' && N!='i' && N!='o' && N!='u' )) N lies outside the range [-20, 20] and [120, 2020] !(N >= -20 && N <= 20) && !( N >= 120 && N <= 2020) OR !( (N >= -20 && N <= 20) || ( N >= 120 && N <= 2020) ) OR (N < -20 || N > 20) && ( N < 120 || N > 2020) National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 3 of 10 c. Read the following program carefully, write down missing code (underline) for output of this program. #include<iostream> #include<bitset> using namespace std; int main() { unsigned short int n; int bitposition; cout<<\"Enter a number\"<<endl; cin>>n; cout<<\"Enter position of",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2775,
    "source_document": "PF Sessional-I (Fall-22) (BS-CS) (Solution).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 3 of 10 c. Read the following program carefully, write down missing code (underline) for output of this program. #include<iostream> #include<bitset> using namespace std; int main() { unsigned short int n; int bitposition; cout<<\"Enter a number\"<<endl; cin>>n; cout<<\"Enter position of bit you want to reverse\"<<endl; cin>>bitposition; cout<<\"Number & it\\'s bit representation before conversion\"<<endl; cout<<n<<\" \"<<bitset<16>(n)<<endl; //bitset will convert n into 16 bit binary. /*In the following missing statements, write an expression to reverse a bit of the input number n at given bit position. int temp=1; temp= temp << bitposition - 1; // int temp =1<<bitposition -1 n= n ^ temp; OR n = n ^ 1 << bitposition - 1; OR n = n ^ (int(pow(2.bitposition-1)));// #include<cmath> cout<<\"Number & it\\'s bit representation after conversion\"<<endl; cout<<n<<\" \"<<bitset<16>(n)<<endl; return 0; } Expected Output 01: Enter a number 5 Enter position of bit you want to reverse 6 Number & it's bit representation before conversion National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 4 of 10 5 0000000000000101 Number & it's bit representation after conversion 37 0000000000100101 Expected Output 02: Enter a number 5 Enter position of bit you want to reverse 3 Number & it's bit representation before conversion 5 0000000000000101 Number & it's bit representation after conversion 1 0000000000000001 Question 2 [ 6 + 3 = 9 Marks] Complete the following code segments by writing statement in the blanked lines. Assume that libraries and main are already included. a. //This program calculates the loss or profit of a product based on cost and selling price. int cp,sp, amt; cout<<\"Enter cost price: \"; cin>>cp; cout<<\"Enter selling price: \"; cin>>sp; if(_______________sp > cp_________________________________) { // Calculate Profit ___________________amt = sp – cp ______________________________; cout<<\"Profit: \"<<amt<<endl; } if(____________cp > sp _____________________________________) { // Calculate Loss ______________amt = cp - sp___________________________________; cout<<\"Loss: \"<<amt<<endl; } if(_____________sp == cp______________________________________) cout<<\"No profit no loss...\"<<endl; National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 5 of 10 b. // A year is a leap year if it is exactly divisible by 4 AND year is not divisible by 100 OR a year is leap year if it is exactly divisible by 400 int year; cin>>year; if((year%4==0 && year%100!=0)|| (year%400==0)) cout<<\"LEAP YEAR\"; else cout<<\"COMMON YEAR\"; Question 3 [ 3+2+3+4+2+3=17 Marks] Write the output of the following programs. Please note that there is no syntax or logical error in the program. Assume that required libraries and main function are already included in the program. a. cout<<\"\\'D\\'\\t\\'i\\'\\t\\'g\\'\\t\\'e\\'\\t\\'s\\'\\t\\'t\\'\\n\"; [1 marks] cout<<setw(10)<<\"\\\\\\n\"<<setw(8)<<\"\\\\\\n\"<<setw(6)<<\"\\\\\\n\"<<setw(4)<<\"\\\\\\n\"<< setw(2)<<\"\\\\\\n\"<<endl; [1 marks] cout<<setw(2)<<\"/\\n\"<<setw(4)<<\"/\\n\"<<setw(6)<<\"/\\n\"<<setw(8)<<\"/\\n\"<<setw(10)<< \"/\\n\"<<endl; [1 marks] Output: National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 6 of 10 b. int flightNum = 89,travelTime,distance; travelTime = distance = 250 / (double)40 ; cout<<travelTime<<endl; Output: 6 c. short int unus, duo, tres; unus = duo = tres = 5.5; unus += 4; duo *= 2; tres -= 4; unus /= 3; duo += tres; cout << unus << endl; cout << duo << endl;",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 3625,
    "source_document": "PF Sessional-I (Fall-22) (BS-CS) (Solution).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "89,travelTime,distance; travelTime = distance = 250 / (double)40 ; cout<<travelTime<<endl; Output: 6 c. short int unus, duo, tres; unus = duo = tres = 5.5; unus += 4; duo *= 2; tres -= 4; unus /= 3; duo += tres; cout << unus << endl; cout << duo << endl; cout << tres << endl; Output 3 11 1 d. char ch=128; if(ch>0) cout <<(int)ch<<endl; ch=-129; if(!(ch<0)) cout <<(int)ch<<endl; ch= ('a' - 'A')*2 + 5; cout <<ch<<endl; Output: 127 E National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 7 of 10 e. int flag = (int(1.5 + 6) % 4); if (!!!flag) cout<<\"*\"<<(5>=6 || 1<8 && 9==7)<<endl; cout <<\"@\"<<(5+1==6 || 8-1 >4)<< endl; Output: @ 1 f. int i=5,k=6; int j=7; if (17<13 && 14>2 || 155%5==1 && 17/5>2 ) cout<<j+i<<endl; else cout<<i-j<<endl; j-=1; if (17<13 && 14>2 || 155%5==1 && 17/5>2 ) cout<<j+i<<endl; else cout<<i-j<<endl; j-=1; if (17<13 && 14>2 || 155%5==1 && 17/5>2 ) cout<<j+i<<endl; else cout<<i-j<<endl; Output: -2. -1 0 National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 8 of 10 Question 4 [ 5+4+3+2=14 Marks] Identify the errors in the following programs, correct them and write the corrected output. a. #include <iostream> #include<iomanip> using namespace std; int main() { int return=2000; //error return is reserved word cout<<\"Loan returned =\" << return <<endl; //error return is reserved word int length= 200.5; cout <<\"Length = \" <<length; char initial = 'a' ; char newchar = initial-32; cout<< newchar <<endl; int ch=100; cout<< (char)ch <<endl; return 0;} Output: Loan returned =2000 Length =200A d b. #include <iostream> using namespace std; int main() { // Float const PI=3.7; Float should be small case float const PI=3.7; //correction cout<<PI+0.3<<endl; //PI = 3.7125; Value of constant cannot be changed // remove the statement correction cout<< \"new value \\n\" << PI <<endl; return 0; } National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 9 of 10 Output: 4 new value 3.7 c. //answer must be in floating point #include <iostream> #include<cmath> using namespace std; int main() { int value1=3, value2, value3; double value1=3,value2,value3; // correction value2 = 3 * pow(value1, 2.0); (double)value3 = 3 + value2 /2-1; error: lvalue required as left operand of assignment // invalid typecasting value3= 3 + (double)value2/2-1; //correction cout << value3 << endl; return 0;} Output: 15.5 d. int n=89; if(n>'A') cout<<(int)A<<endl; //error: A not declared in scope //correction : cout<<(int)’A’<<endl; else cout<<(char)n; Output 65 National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 10 of 10 ROUGH WORK Note: anything written on this page will not be marked.",
    "chunk_type": "generic",
    "word_count": 448,
    "char_count": 2821,
    "source_document": "PF Sessional-I (Fall-22) (BS-CS) (Solution).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "Question 01[20 marks] Write the output of the given C++ code segments. Please note there are no syntax errors in the given set of codes. And all the code snippet contains #include<iostream> and using namespace std; Code Output (A)(2 Mark) What would be the output produced by executing the following C++ code? float Mystery(int y, int x){ return (y + x + 7.0 / 2); } int main(){ float i = 9.5; int j = 4; cout << Mystery(i, j) << endl; return 0; } 16.5 (B)(2 Mark) What would be the output produced by executing the following C++ code? int main() { int i = 65; for (char ch = i; ch <= 70; ++ch) cout << ch << \" \"; return 0; } A B C D E F (C)(2 Mark) What would be the output produced by executing the following C++ code? int fun(int x){ return x % 3 + 1; } int main() { int b = 5; int y = 2 + fun(3 * b + 1); int z = fun(fun(y)); cout << y << \"-\" << z; return 0; } 4-3 (D)(4 Mark) What would be the output produced by executing the following C++ code? void PRINT(int i,int limit) { do { if (i++ < limit) { cout<<\"MID\"<<i; continue; } }while(i==limit); } int main() { int i = 1; PRINT(i, 3); return 0; } MID2 (E) (4 Mark) What would be the output produced by executing the following C++ code? int main(){ int x, y = 4; for (x = 2; x < y; x++) y = y - 1 % x; cout << y << \"-\"; x = 4; do{ cout << --x << \"-\"; x *= 2; } while (x <= 10); return 0;} 3-3-5-9- (F) (3 Mark) What would be the output produced by executing the following C++ code? int main(){ int i, j, sum = 10; for (i = 0; i<5; i++) if (i % 2) for (j = 0; j <= 3; sum += j, j++); else for (j = 3; j>0; sum += j, j--); cout << sum; } 40 (G)(2 Mark) What would be the output produced by executing the following C++ code? int main(){ int y = 0; switch (y){ case 0: y = y + 11; case 1: y = y / 2; case 2: y = y * 5; case 3: y = y + 1; default: y = y%3; 2 } cout << y << endl; return 0; }",
    "chunk_type": "generic",
    "word_count": 416,
    "char_count": 1841,
    "source_document": "PF Sessional-II (Fall-20) (Solution).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences School of Computing Fall 2022 Islamabad Campus CS-1002 Programming Fundamentals BS(DS/AI) Thursday, November 10, 2022 Course Instructor Mr. Adil Majeed, Ms. Ayesha Kamran, Dr. Hasan Mujtaba Serial No: Sessional II Total Time: 1 Hour Total Marks: 60 Signature of Invigilator Student Name Roll No Section Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on the question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use the back of the last page for rough work. 3. If you need more space, write on the back side of the paper ( only for questions number II, III and IV ) and mark the question and part number etc. 4. After being asked to commence the exam, please verify that you have (8) different printed pages, including this title page. There is a total of (4) questions. 5. Use of a calculator is strictly prohibited. 6. Use permanent ink pens only. Any part done using a soft pencil will not be marked and cannot be claimed for rechecking. 7. Use proper indentation while writing code and ensure that your code is legible. You will lose your marks If your code is not clear. 8. Please read the question thoroughly and use your time properly; an uneven time distribution can lead to incom- plete answers. I II III IV Total Total Marks 36 8 8 8 60 Marks Obtained CS-1002 Programming Fundamentals BS(DS/AI) Fall 2022 Sessional II Question I. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .(36 Marks) Only the code of main function is written without return 0 statement. So please don’t identify those errors. (a) (2 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 int a, b, c; 2 a=6,b=4,c=2; 3 int max = (a>b>c)*(a+b+c); 4 cout<<max; (b) (3 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 char alphabet= 'A'; 2 for(int i = ('F'-'A'+1); i >= 1; --i) 3 { 4 for(int j = 1; j <= i; ++j) 5 { 6 cout << alphabet << \" \"; 7 } 8 ++alphabet; 9 cout << endl; 10 } (c) (3 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 int i, j, m, answer; 2 m = 0; 3 j = 4; 4 while (m < 5) { 5 for (i = 0; i",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2472,
    "source_document": "PF Sessional-II (Fall-22) (BS-AI_DS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "<< endl; 10 } (c) (3 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 int i, j, m, answer; 2 m = 0; 3 j = 4; 4 while (m < 5) { 5 for (i = 0; i < j; i++){ 6 answer = i * m; 7 cout << answer; 8 } 9 m = m + 1; 10 cout << endl;} (d) (1 Mark) What is the output of the following program segment? Identify errors (if any). 1 int x = 5, y = 10; 2 int z = ++x * y--; 3 cout<<(z+y); (e) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 int x=10; 2 { 3 cout<<x<<\"\\t\"; 4 int x=20; 5 cout<<(x++)<<\"\\t\"; 6 } 7 cout<<(--x); (f) (1 Mark) What is the output of the following program segment? Identify errors (if any). 1 int z = 5, j = 7, k = 6, n = 3; 2 cout << (z + j % k + k * n - 15) << \"\\t\" ; 3 cout << (z % n + 5) << endl; Page 2 of 8 CS-1002 Programming Fundamentals BS(DS/AI) Fall 2022 Sessional II (g) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 int i = 12, counter = 5; 2 while (i - 1) 3 { 4 ++counter; 5 i--; 6 } 7 cout<<counter; (h) (1 Mark) What is the output of the following program segment? Identify errors (if any). 1 int a=5; 2 int b=a++++; 3 cout<<b; (i) (2 Marks) What is the output of the following program segment? Identify errors (if any). Assume uninitial- ized variable has value zero in beginning. 1 int x=10; 2 { 3 int x=x; 4 cout<<x<<\"\\t\"; 5 } 6 cout<<(--x); (j) (2 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 int suite = 5 ; 2 switch ( suite ) ; 3 { 4 case 0+5 ; 5 cout<< \"\\nClub\" ; 6 case 1+5 ; 7 cout<< \"\\nDiamond\" ; 8 } Page 3 of 8 CS-1002 Programming Fundamentals BS(DS/AI) Fall 2022 Sessional II (k) (1 Mark) What is the output of the following program segment? Identify errors (if any). Assume uninitial- ized variable has value zero in beginning. 1 int i=0, n = 0; 2 if ((i < 1) && (++i < n)) 3 { 4 cout << \"Condition True!\"; 5 } 6 else 7 cout<<\"Not True\"; (l) (2 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 int x = 8, y = 0, z ; 2 while ( x >= 0 && y <=5 ) 3 { 4 if ( x == y ) 5 break ; 6 else 7 cout<<x<<y ; 8 x-- ; 9 y+=2 ; 10 } (m) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 int",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2307,
    "source_document": "PF Sessional-II (Fall-22) (BS-AI_DS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "x >= 0 && y <=5 ) 3 { 4 if ( x == y ) 5 break ; 6 else 7 cout<<x<<y ; 8 x-- ; 9 y+=2 ; 10 } (m) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 int z, x=5, y=-10, a=4, b=2; 2 z = x++ - --y * b / a; 3 cout<<z; (n) (3 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 int x = 1, y =2, n=50 ; 2 while (y <=n ) 3 { 4 if ( n%y == 0 ) 5 { 6 n=n/y; 7 x=x+1; 8 } 9 else 10 y=y+1; 11 cout<<x<<y<<\" \"; 12 } (o) (2 Marks) What will the following program display on screen. Explain the error or bug if there is any. 1 int a = 0, b=26; 2 float f=2.6; 3 b+= (a = 50)*f/2*10-b\\%5; 4 cout << a << \"#\" << b; Page 4 of 8 CS-1002 Programming Fundamentals BS(DS/AI) Fall 2022 Sessional II (p) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 float Mystery(int y, int x){ 2 return (y + x + 7.0 / 2); } 3 int main(){ 4 float i = 9.5; 5 int j = 4; 6 cout << Mystery(i, j) << endl; } (q) (2 Marks) What is the output of the following program segment? Identify errors (if any). 1 int fun(int x){ 2 return x % 3 + 1; } 3 int main() { 4 int b = 5; 5 int y = 2 + fun(3 * b + 1); 6 int z = fun(fun(y)); 7 cout << y << \"-\" << z; } (r) (3 Marks) Convert the following code (of switch) in if-else decision structures. 1 cin >> sport; 2 switch (sport) { 3 case 'c': 4 cout << \"You like Cricket\"; 5 case 'f': 6 cout << \"You like Football\"; 7 break; 8 case 't': 9 case 'H': 10 cout << \"You like Tennis\"; 11 cout << \"You like Hockey\"; 12 case 'B': 13 cout << \"You like BasketBall\"; 14 break; } Page 5 of 8 CS-1002 Programming Fundamentals BS(DS/AI) Fall 2022 Sessional II Question II . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (8 Marks) (a) (8 Marks) Write a function in c++ which takes a number as input and prints the pattern of alphabets as given below. You are required to validate the input that the number should be in-between 1 and 26. For example, for n=5, print",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2098,
    "source_document": "PF Sessional-II (Fall-22) (BS-AI_DS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": ". . . . (8 Marks) (a) (8 Marks) Write a function in c++ which takes a number as input and prints the pattern of alphabets as given below. You are required to validate the input that the number should be in-between 1 and 26. For example, for n=5, print pattern as below A B C D E D C B A B C D E D C B C D E D C D E D E for n=4, print pattern as below A B C D C B A B C D C B C D C D Page 6 of 8 CS-1002 Programming Fundamentals BS(DS/AI) Fall 2022 Sessional II Question III . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (8 Marks) (a) (8 Marks) Write a function in c++ which takes a number n as input (parameter) and return sum of all digits except unit digit (rightmost digit), is equal to the unit digit(rightmost). If the function returns the sum of digits, then print YES in main otherwise print NO. For Example, if the user enters 1124 it will print YES because 1+1+2 is equal to 4 While if the user enters 2348 it will print No because 2+3+4 is not equal to 8. Page 7 of 8 CS-1002 Programming Fundamentals BS(DS/AI) Fall 2022 Sessional II Question IV . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . (8 Marks) (a) (8 Marks) The value of a function F is defined by the following infinite series: F = 1 3 + x2 9 + x4 27 + x6 81 + x8 243 + · · · Write a C++ code that takes n (number of terms) and the value of x as input from the user and calculates the function’s value. In other words, calculate the sum of the series for the first N terms. For example, if n=5 and x=2, then it should display 0.744856. Page 8 of 8",
    "chunk_type": "generic",
    "word_count": 473,
    "char_count": 1760,
    "source_document": "PF Sessional-II (Fall-22) (BS-AI_DS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  },
  {
    "text": "and x=2, then it should display 0.744856. Page 8 of 8",
    "chunk_type": "generic",
    "word_count": 11,
    "char_count": 53,
    "source_document": "PF Sessional-II (Fall-22) (BS-AI_DS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 4
    }
  },
  {
    "text": "National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus ____________________ ____________ _____________ __________________ Student Name Roll No. Course Section Student Signature DO NOT OPEN THE QUESTION BOOK OR START UNTIL INSTRUCTED. Instructions: 1. Attempt on question paper. Attempt all of them. Read the question carefully, understand the question, and then attempt it. 2. No additional sheet will be provided for rough work. Use last page for rough work. 3. After asked to commence the exam, please verify that you have ten (10) different printed pages including this title page. There are a total of 3 questions. 4. Calculator is strictly prohibited. 5. Use permanent ink pens only. Any part done using soft pencil will not be marked and cannot be claimed for rechecking. Q-1 Q-2 Q-3 Total Marks Obtained Total Marks 10 35 15 60 Serial No: Sessional Exam-II Total Time: 1 Hour Total Marks: 60 ________________ Signature of Invigilator CS-1002: Programming Fundamentals (CS) Thursday, 17th November, 2022 Course Instructors Dr. Aleem, Dr. Akhtar, Ms. Ifrah, Mr. Sheheryar National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 2 of 10 Question 1 [5+5=10 Marks] 1.1: Consider the following C++ code and answer the questions below. #include <iostream> using namespace std; int main() { const int N=3; int A[N]={3,2,1}; int B[N]={0}; for(int i = 0; i < N; ++i) { int length = 1; while (A[i] != 1) { if (A[i] % 2) A[i] = A[i] * 3 + 1; else A[i] /= 2; ++length; } B[i]= length; } return 0; } a. What are the contents of array B when 1st iteration of for loop terminates. B[0] B[1] B[2] 8 0 0 b. What are the contents of array B when 2nd iteration of for loop terminates. B[0] B[1] B[2] 8 2 0 c. What are the contents of array B when 3rd iteration of for loop terminates. B[0] B[1] B[2] 8 2 1 National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 3 of 10 1.2: Consider the following C++ code and answer the questions below. int get(int N) { static int i = 0; return N-(i++) - 1; } int main() { int SIZE = 10; int arr[] = {5,6,7,8,9,10,11,12,13,14}; int j; for(int i=0; i < SIZE; i++) { j = get(SIZE); if (j==i) continue; arr[i] += arr[j]; arr[j] = arr[i] - arr[j]; arr[i] -= arr[j]; } return 0; } a. What are the contents of array after 2nd iteration of for loop? arr[0] arr[1] arr[2] arr[3] arr[4] arr[5] arr[6] arr[7] arr[8] arr[9] 14 13 7 8 9 10 11 12 6 5 b. What are the contents of array after for loop terminates? arr[0] arr[1] arr[2] arr[3] arr[4] arr[5] arr[6] arr[7] arr[8] arr[9] 5 6 7 8 9 10 11 12 13 14 National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 4 of 10 Question 2 [5+2+3+5+5+5+5+5= 35 Marks] For the following questions, write the output of the program in the given box. In case",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2922,
    "source_document": "PF Sessional-II (Fall-22) (BS-CS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 0
    }
  },
  {
    "text": "arr[9] 5 6 7 8 9 10 11 12 13 14 National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 4 of 10 Question 2 [5+2+3+5+5+5+5+5= 35 Marks] For the following questions, write the output of the program in the given box. In case of no output write NO Output with the reason (No marks without mentioning the reason). int list[5]={2,4,8,10,-1}; int nextList[5]={3,-1,0,1,-1}; int start = 2; int Free = 4; void magic(int val , int position){ int start = ::start; for(int i = 0 ; i< position - 1 ; i++) start=nextList[start]; list[Free]=val; nextList[Free]=nextList[start]; nextList[start]=Free++; } void magic(){ int start = ::start; while(start != -1){ cout<<list[start]<<\"->\"; start=nextList[start]; } cout<<\"*\"<<endl; } int main() { magic(); magic(5,2); magic(); return 0; } Output: 8->2->10->4->* 8->2->5->10->4->* Each line 2.5 marks Correct output at correct place National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 5 of 10 C++ Program Output float calc(int y, int x) { return (y + x + 7.0 / 2); } int main() { float i = 9.5; int j = 4.5; cout << calc(i, j) << endl; } 16.5 float x = 10; while (x < 100) { int x = 20; x *= 5; x -= 10; } cout << x << endl; No output. Infinite loop char text[] = \"Hello WorlD\"; int i = 0; while (text[i] != '\\0') { if (text[i] =='W'||text[i]=='H'|| text[i] == 'D') text[i] = '#'; else if (text[i]>='a'&&text[i]<='z') text[i] -= 32; else if (i % 2 == 0) text[i] = text[i] - 1; else text[i] = '&'; i++; } cout << text << endl; #ELLO&#ORL# int MAX = 70; for (char ch = 65; ch <= MAX; ++ch) { int i = 'A'; while (true) { if (i++ % 2 == 0) continue; if (i > ch) break; cout << ch << \" \"; } cout << endl; } B C D D E E F F F National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 6 of 10 int x, y = 4; for (x = 2; x < y ; x+=2) y = y + 1 % x; cout << y << endl; x = y; do { cout << --x << endl; x *= 4; } while (x <= 10); 6 5 int i, j, sum = 10; for (i = 0; i<5; i++) if (i % 2) for (j = 0; j <= 3; sum += j++); else for (j = 3; j>0; sum += --j); cout << sum; 31 Note: correct output 5 marks int r=5,x=0; while(x<r){ int y=1; while(y<r-x){ cout<<\" \"; y++; } int z=0,n=1; while(z<=x){ n= z==0 || x==0 ? 1 : n*(x-z+1)/z; char ch = n==1 ? 'X' : n%3==0 ? 'Y' : 'V' ; cout<<ch<<' '; z++; } cout<<'\\n'; x++; } National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 7 of 10 Question 3 [5+5+5=15 Marks] Complete the following C++ code by selecting the correct C++ statement or answer.",
    "chunk_type": "generic",
    "word_count": 512,
    "char_count": 2625,
    "source_document": "PF Sessional-II (Fall-22) (BS-CS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 1
    }
  },
  {
    "text": "'X' : n%3==0 ? 'Y' : 'V' ; cout<<ch<<' '; z++; } cout<<'\\n'; x++; } National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 7 of 10 Question 3 [5+5+5=15 Marks] Complete the following C++ code by selecting the correct C++ statement or answer. Ambiguous selection will be treated as false. Description: Log base 2, also known as binary logarithm which is the inverse function of the power of two functions. The general logarithm states that for every real number n, can be expressed in exponential form as n=ax Following function finds log base 2 of 32 bit integer int log2(int x) { int res = 0; while (x >>= 1) res++; return res; } a. x >>= 2 b. x >>= 1 c. x <<= 2 d. x <<= 1 e. x ~= 2 f. None of the above Description: Following functions checks if given integer is power of 2 bool isPowerof2(int x) { return (x && !(x & x-1)); } a. (x && !(x && x-1)) b. (x || !(x || x-1)) c. (x & !(x & x-1)) d. (x | !(x && x-1)) e. (x && !(x & x-1)) f. None of the above National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 8 of 10 Description: Given an array arr[] of size N-1 with integers in the range of [1, N], the task is to find the missing number from the first N integers. Note: There are no duplicates in the list. Examples: Input: arr[ ] = {1, 2, 4, 6, 3, 7, 8}, N = 8 Output: 5 Explanation: The missing number between 1 to 8 is 5 #include <iostream> using namespace std; int main() { int arr[ ] = { 1, 10, 3, 7, 5, 6, 9, 2, 8 }; const int N = sizeof(arr) / sizeof(arr[0]); int i; int temp[N + 1]; N &= N; for(int i = 0; i <= N; i++){ temp[i] = 0; } for(i = 0; i < N; i++){ temp[arr[i] - 1] = 1; } int ans; for (i = 0; i <= N ; i++) { if (temp[i] == 0) ans = i + 1; } cout <<ans<<endl; } a. arr[temp[i] - 1] = 1; b. arr[temp[i] + 1] = 1; c. temp[arr[i] - 1] = 1; d. temp[arr[i] + 1] = 1; e. None of the above National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 9 of 10 ROUGH WORK Note: anything written on this page will not be marked. National University of Computer and Emerging Sciences FAST School of Computing Fall-2022 Islamabad Campus Page 10 of 10 ROUGH WORK Note: anything written on this page will not be marked.",
    "chunk_type": "generic",
    "word_count": 463,
    "char_count": 2291,
    "source_document": "PF Sessional-II (Fall-22) (BS-CS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 2
    }
  },
  {
    "text": "marked.",
    "chunk_type": "generic",
    "word_count": 1,
    "char_count": 7,
    "source_document": "PF Sessional-II (Fall-22) (BS-CS).pdf",
    "doc_type": "past_paper",
    "course": "Programming Fundamentals",
    "course_code": "CS-101",
    "metadata": {
      "chunk_id": 3
    }
  }
]